{
    "C:\\Users\\user\\Desktop\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-A-001_工業自動化與控制系統資訊安全政策 Industrial Automation and Control System Cyber Security Policy_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：一般                      Level of Confidentiality: Normal\n文件編號：IMI-NCKU-A-001          Form No.: IMI-NCKU-A-001\n版    次：1.2                       Version: 1.2\n發行日期：2023.05.20                 Issue Date: 2023.05.20\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t2\n4.\t名詞定義Definition of Terms\t2\n5.\t資訊安全目標The Targets of the Cyber Security\t2\n6.\t責任Responsibilities\t3\n7.\t審查Review\t3\n8.\t實施Implementation\t3\n9.\t參考文件Reference\t4\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）與專案場域執行之專案（以下簡稱本專案）所屬資訊資產可用性、機密性與完整性，並符合相關法規之規範要求，使其免於遭受內、外部的蓄意或意外之威脅，並衡酌本實驗室之業務需求，有效落實專案場域之資安措施，特制定本政策以玆遵循。\nTo ensure the availability, confidentiality, and integrity of information assets belonging to the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and the projects executed within the project field (hereinafter referred to as \"the Project\"), and to comply with relevant regulatory requirements, safeguarding them against intentional or unintentional internal and external threats, while considering the operational needs of the Lab, this policy is hereby established for effective implementation of cyber security measures within the project field.\n2. 適用範圍Scope of Application\n本實驗室所提供工業自動化與控制系統之專案場域相關人事物皆適用。\n工業自動化與控制系統資訊安全標準IEC 62443-2-4中12項安全計畫(Security Programs, SP)規範事項涵蓋範圍如下：\nThis policy is applicable to all personnel, events, and objects related to industrial automation and control system projects provided by the Lab.\nThe scope of the 12 Security Program (SP) requirements in the accordance with IEC 62443-2-4 is as follows:\n2.1 人員安全管理政策與執行\nPersonnel Safety Management Policy and Implementation\n2.2 場域安全服務強化與執行\nField Security Service Strengthening and Implementation\n2.3 場域安全架構設計與執行\nField Security Architecture Design and Implementation\n2.4 網路通訊安全設計與執行\nNetwork Communication Security Design and Implementation\n2.5 安全儀控系統設計與執行\nSafety Instruments Systems Design and Implementation\n2.6 組態管理與執行\nConfiguration Management and Execution\n2.7 遠端存取管理與執行\nRemote Access Management and Execution\n2.8 資訊安全事件管理與執行\nCyber Security Incident Management and Execution\n2.9 帳戶管理與執行\nAccount Management and Execution\n2.10 惡意程式防護管理與執行\nMalware Protection Management and Execution\n2.11 修補程式管理與執行\nPatch Management and Execution\n2.12 備份還原管理與執行\nBackup and Restore Management and Execution\n3. 權責Roles and Responsibilities\n本實驗室與專案場域負責執行專案之內部人員、委外服務廠商與訪客皆應遵守本政策。\nThe internal personnel, outsourced service providers, and visitors of the Lab and the project field who are responsible for implementing the project shall abide by this policy.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 資訊安全目標The Targets of the Cyber Security\n維護本實驗室所提供專案場域之資訊資產正常運作，防止資訊或資訊系統受未經授權之存取、使用、控制、洩漏、破壞、竄改、銷毀或其他侵害，並確保其資產之可用性、完整性與機密性，且所有專案團隊人員應共同努力達成下列目標：\nIn order to maintain the normal operation of information assets in the project field provided by the Lab, prevent information or information systems from unauthorized access, use, control, leakage, destruction, tampering, destruction or other infringements; and ensure the availability, integrity and confidentiality of their assets, all project team personnel shall work together to achieve the following goals:\n5.1 保護本實驗室與專案場域資訊業務活動，避免未經授權的存取。\nProtect the Lab and project field cyber operation activities to avoid unauthorized access.\n5.2 保護本實驗室與專案場域資訊業務活動，避免未經授權的修改，確保其正確且完整。\nProtect the Lab and project field cyber operation activities to avoid unauthorized modification, and ensure its correctness and completeness.\n5.3 依照客戶對於工業自動化資訊安全要求，建立工業自動化資訊安全專案場域服務，進行專案場域風險管理，並依循IEC 62443-2-4需求項目落實品質管理循環(PDCA)精神，以持續改善工業自動化資訊安全管理系統之有效性。\nAccording to the client's requirements for industrial automation cyber security, establish industrial automation cyber security services for the project field, conduct risk management for the project field, and follow the IEC 62443-2-4 requirements items to implement the spirit of the quality management cycle (Plan-Do-Check-Act cycle, PDCA) to continuously improve the effectiveness of the industrial automation cyber security management system.\n5.4 辦理本實驗室與專案場域有關資訊安全教育訓練，提供單位學員資訊安全之意識與強化其對責任之認知。\nConduct cyber security education and training in the Lab and project field, and enhance the awareness of cyber security among department members while reinforcing their understanding of responsibilities.\n5.5 本實驗室及專案場域有關工業自動化資訊安全業務活動的執行須符合法令或法規之要求。\nThe implementation of the industrial automation cyber security operation activities in the Lab and the project field must comply with the requirements of laws and regulations.\n5.6 透過利害相關人及議題等要求事項，達成與資訊安全政策一致之預期。\nAchieving alignment with cyber security policy expectations through stakeholder requirements and issues etc.\n6. 責任Responsibilities \n6.1 管理階層應積極參與及支持資訊安全管理制度，並透過適當的標準和程序以實施本政策。\nManagers shall actively participate in and support the cyber security management system and implement this policy through appropriate standards and procedures.\n6.2 專案人員、委外廠商與專案相關之外部單位及人員均需依照相關安全管理程序以維護資訊安全政策。\nProject personnel, subcontractors, and project-related external units and personnel must follow relevant security management procedures to maintain cyber security policies.\n6.3 所有人員皆有責任報告資訊安全事件和任何已鑑別出之弱點。\nAll personnel are responsible for reporting cyber security incidents and any identified vulnerabilities.\n6.4 任何危及資訊安全之行為，將視情節輕重追究其刑事、民事及行政責任，或依成功大學之相關規定進行懲處。\nAny actions that endangers cyber security shall be investigated for criminal, civil, and administrative responsibilities depending on the severity of the case, or shall be punished according to the relevant regulations of NCKU.\n7. 審查Review\n7.1 本政策應至少每年審查一次，以反映政府法令、技術及業務等最新發展現況，並確保本校永續運作及工控資訊安全實務作業之能力。\nThis policy shall be reviewed at least once a year to reflect the latest developments in government laws, technology, and business, and to ensure the sustainable operation of the school and the capability of industrial automation and control system cyber security practices.\n7.2 當專案團隊或專案發生重大改變時應主動進行審查。\nThis policy shall be actively reviewed when the project team or project undergoes significant changes.\n8. 實施Implementation\n本政策需經專案團隊進行查驗後實施，修正時亦同。\nThis policy and its revisions shall be implemented after being reviewed by the project team.\n9. 參考文件Reference\n9.1 IEC 62243-2-4:2015\n\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n文件編號\nForm No.\nIMI-NCKU-A-001\n機密等級\nLevel of Confidentiality\n一般\nNormal\n版次\nVersion\n1.2\n\n\n\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n文件編號\nForm No.\nIMI-NCKU-A-001\n機密等級\nLevel of Confidentiality\n一般\nNormal\n版次\nVersion\n1.2\n\n\n1\n\n3\n\n",
    "C:\\Users\\user\\Desktop\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-001_資訊安全組織程序書 Cyber Security Organization Process_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n資訊安全組織程序書\nCyber Security Organization Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-001         Form No.: IMI-NCKU-B-001\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t1\n4.\t名詞定義Definition of Terms\t1\n5.\t作業說明Operation Instructions\t1\n6.\t參考文件Reference\t11\n\n\n1. 目的Purpose\n為促進國立成功大學資訊與機電整合實驗室（以下稱本實驗室）資訊安全管理制度執行，以有效性之組織架構達成既定之目標，增進業務運作之安全，特制定本程序書。\nTo promote the implementation of the cyber security management system at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\"), and to achieve the established objectives of effectiveness in the organizational structure, and enhance the security of business operations, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and the project field.\n3. 權責Roles and Responsibilities \n3.1 計畫主持人：外部溝通、專案稽核與核可、人員指派。\nProject principal: External communication, project audit and approval, personnel assignment.\n3.2 專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3 行政專員：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4 軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware department: Technology development, patch the program, project schedule planning.\n3.5 測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 作業說明Operation Instructions\n5.1 資訊安全組織架構與工作執掌\nCyber security organizational structure and work management\n5.1.1 資訊安全組織架構如下圖所示，資訊安全組織成員應填寫於「IMI-NCKU-D-001 資訊安全組織成員表」，若遇人員異動應加以更新。 \nThe cyber security organization structure is shown in the figure below. Members of the cyber security organization shall be documented in the \"IMI-NCKU-D-001 Cyber Security Organization Personnel List\" and updated accordingly in the event of personnel changes.\n\n\n圖 1，組織架構圖範例。\n\nFigure 1, Example of the organization structure.\n\n5.1.2 資訊安全管理委員會：由本實驗室計畫主持人指派之國立成功大學資訊與機電整合實驗室資訊安全管理委員會，負責審查資訊安全管理制度相關事項之決議。\nCyber Security Management Committee: The Cyber Security Management Committee of the National Cheng Kung University Information and Mechatronics Integration Lab is appointed by the project principal and is responsible for reviewing resolutions on matters related to cyber security management system.\n(1) 每年定期或視需要召開會議，審查資訊安全管理相關事宜。\nHold meetings on a regular basis or as needed every year to review matters related to cyber security management.\n(2) 視需要召開跨部門之資源協調會議，以協調資訊安全管理制度執行所需之相關資源分配。\nHold cross-departmental resource coordination meetings as necessary to coordinate the allocation of relevant resources required for the implementation of the cyber security management system.\n(3) 確認政策與目標一致性。\nVerify that policies are consistent with objectives.\n(4) 滿足資訊安全相關要求的承諾。\nCommit to meet relevant cyber security requirements.\n(5) 持續改善資訊安全管理系統的承諾。\nCommit to the continuous improvement of the cyber security management system.\n5.1.3 制度管理人或召集人：由本實驗室計畫主持人或由計畫主持人指派專人擔任。\nSystem Manager or Convener Person: Shall be appointed by the project principal of the Lab or designated by the project principal.\n5.1.4 資訊安全官：由資訊安全委員會指派專人擔任。 \nCyber Security Officer: A special person appointed by the Cyber Security Committee.\n(1) 協調資訊安全小組與緊急處理組執行資訊安全相關作業。\nCoordinate the cyber security team and the emergency response team to execute cyber security related operations.\n(2) 對於資訊安全管理之改善提出建議，以及協助執行資訊安全之自我檢核。\nProvide recommendations for the improvement of cyber security management, and assist in the implementation of self-assessment of cyber security.\n(3) 負責對資訊安全狀況進行預警、監控，並對資訊安全狀況與事件進行處置。\nResponsible for early warning and monitoring of cyber security status, and handling cyber security status and events.\n(4) 對於存取控制管理定期進行事件紀錄檢核，以及管理程序檢核。\nRegularly check the event records and management procedures for access control management.\n5.1.5 資訊安全小組：由資訊安全委員會指派人員組成，負責規劃及執行各項資訊安全作業。\nCyber Security Team: Composed of personnel assigned by the Cyber Security Committee, responsible for planning and executing various cyber security operations.\n(1) 資訊安全組織人員異動時，負責更新。\nWhen the personnel of the cyber security organization changes, they are responsible for updating.\n(2) 制定資訊安全管理相關規範。\nFormulate relevant specifications for cyber security management.\n(3) 辦理資訊安全相關教育訓練及活動。\nConduct cyber security-related education, training and activities.\n(4) 建立風險管理制度，執行風險管理。\nEstablish a risk management system and implement risk management.\n(5) 建立安全事件緊急應變暨復原措施。\nEstablish emergency response and recovery measures for security incidents.\n(6) 執行稽核改善建議事項。\nImplement audit improvement recommendations.\n(7) 執行預防措施之改善。\nImplementation of preventive measures for improvement.\n(8) 研討新資訊安全產品或技術。\nDiscuss new cyber security products or technologies.\n(9) 執行資訊安全管理委員會決議事項。\nImplement the resolutions of the Cyber Security Management Committee.\n(10) 鑑別資訊安全相關之法規。\nIdentify laws and regulations related to cyber security.\nA. 資訊安全小組應每年於召開管理審查會議前，針對本實驗室提供之資訊服務來識別資訊安全的相關法令、法規與契約之要求。\nThe Cyber Security Team shall identify the requirements of relevant laws, regulations and contracts for cyber security pertaining to the cyber services provided by the Lab before holding the management review meeting every year.\n5.1.6 緊急處理組：緊急處理組為任務編組，由本實驗室計畫主持人指派人員組成，成員相關權責及作業內容分述如下：\nEmergency Response Team: The Emergency Response Team shall be formed as a task group, comprising personnel assigned by the Lab project principal. The relevant roles and responsibilities of the members and the work content are as follows:\n(1) 緊急處理組組長：\n\tEmergency Response Team Leader:\nA. 當重大資安事件發生時，負責聯絡召集緊急處理組。\nWhen a major cyber security event occurs, the Leader is responsible for contacting assembling the Emergency Response Team.\nB. 協調及督導各關鍵業務流程負責人執行緊急處理作業，並協調資源之調派使用。\nCoordinate and supervise the persons in charge of each key business process to execute emergency handling operations, and coordinate the deployment and use of resources.\nC. 依據事件評估之結果，得報告上級以決議是否宣布災變及啟動業務永續運作計畫。\nAccording to the results of the event evaluation, report to the superior to decide whether to declare a disaster and start the business continuity operation plan.\nD. 當災難發生時，配合救災單位負責搶救人員、物資與設備等及現場指揮工作。\nWhen a disaster occurs, cooperate with the disaster relief unit to be responsible for rescuing personnel, materials and equipment, etc. and on-site command work.\nE. 負責災後協調指揮清理災害現場及復原工作。\nResponsible for post-disaster coordination to clean up disaster sites and conduct restoration work.\n(2) 各關鍵業務流程負責人員：\nPersonnel responsible for each key business process:\nA. 負責對資訊安全狀況進行預警、監控，及對資訊安全事件進行處置\nResponsible for early warning and monitoring of cyber security status and handling of cyber security incidents.。\nB. 負責召集相關人員，發展、維護、更新修訂及執行各災害復原程序。\nResponsible for assembling relevant personnel and for developing, maintaining, updating, revising and implementing various disaster recovery procedures.\nC. 每年負責召集相關人員進行業務永續運作計畫之測試演練。\nResponsible for annually organize testing exercises for business continuity operations involving relevant personnel.\nD. 負責原營運場所或異地備援場所之應變、處理、復原及運轉測試工作。\nResponsible for the response, processing, restoration, and operation test of the original operating site or remote backup site.\nE. 負責災害現場證據收集，俾利未來訴訟與損害求償事宜。\nResponsible for the collection of evidence at the disaster site to facilitate future litigation and damage claims.\nF. 災害現場評估損害狀況及執行原營運場所之現場復原工作。\nAssess the damage of the disaster site and perform on-site restoration of the original operating site.\n5.1.7 資訊安全稽核小組：由本實驗室計畫主持人指派，負責評估資訊安全管理制度之執行情形。\nCyber Security Audit Team: Assigned by the Lab project principal, responsible for assessing the implementation status of the cyber security management system.\n(1) 擬定資訊安全內部稽核計畫。\nDraft the plan for an internal audit of cyber security.\n(2) 執行資訊安全內部稽核。\nExecute the internal audit of cyber security.\n(3) 撰寫資訊安全內部稽核報告。\nWrite internal audit reports on cyber security.\n(4) 追蹤不符合事項之改善執行情形。\nTrack and improve implementation of non-conformities.\n5.2 管理審查會議\nManagement Review Meeting\n5.2.1 資訊安全管理委員會每年應召開一次管理審查會議，必要時得召開臨時會議。\nThe Cyber Security Management Committee shall hold a management review meeting every year, and may hold interim meetings when necessary.\n5.2.2 管理審查會議審查內容建議包含：\nThe content recommendations of management review meeting include:\n(1) 過往管理審查之議案的處理狀態。\nprocessing status of the proposals from previous management reviews.\n(2) 與資訊安全管理制度有關之內部及外部議題的變更。\nChanges in internal and external issues related to the cyber security management system.\n(3) 資訊安全績效之回饋，包括下列之趨勢：\nFeedback on cyber security performance, including the following trends:\nA. 不符合項目及矯正措施。\nNonconforming items and corrective measures.\nB. 監督及量測結果。\nMonitoring and measurement results.\nC. 稽核結果。\nAudit results.\nD. 資訊安全目標之達成。\nAchievement of cyber security objectives.\n(4) 關注方之回饋。\nFeedback from interested parties.\n(5) 風險評鑑結果及風險處理計畫之狀態。\nThe status of risk assessment results and risk handling plans.\n(6) 持續改善之機會。\nOpportunities for continuous improvement.\n(7) 資安治理成熟度評估。\nCyber security governance maturity assessment.\n(8) 資訊安全目標執行狀況報告。\nCyber security target implementation status report.\nA. 以「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」設定之目標為資訊安全目標。\nAccording to the \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\" to set the cyber security goals.\nB. 依「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」所列之範圍及目標擬制定CSMS有效性量測表，並以該表之量測結果做為本項審查項目之主要討論內容。\nFormulate a CSMS effectiveness measurement form according to the scope and objectives listed in \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\" and use the measurement results as a basis to discuss each review item.\nC. 資訊安全執行小組擬藉由CSMS有效性量測表之量測項目與目標水準建立CSMS績效指標，蒐集各項量測項目之相關資料，據以評估本實驗室資訊安全目標之達成情形。\nThe Cyber Security Execution Team intends to establish CSMS performance indicators based on the measurement items and target levels of the CSMS effectiveness measurement form, and collect relevant data on each measurement item to evaluate the Lab's achievement of cyber security goals.\n5.2.3 管理審查會議之決議事項建議包含：\nSuggestions for resolutions at the management review meeting include:\n(1) 與持續改善機會有關之決策。\nDecisions related to continual improvement opportunities.\n(2) 任何對資訊安全管理系統變更之需要。\nAny need for changes to the cyber security management system.\n(3) 資訊安全制度執行之各項改進措施。\nVarious improvement measures for the implementation of the cyber security system.\n(4) 更新風險評鑑與風險處理計畫。\nUpdated risk assessment and risk management plans.\n(5) 針對可能影響資訊安全制度之內外部事件，修正資訊安全管理流程與控制措施。內外部事件包括：\nRevisions to the cyber security management process and control measures in response to internal and external events that may affect the cyber security system. Internal and external events include:\nA. 營運需求的變更。\nChanges in operational requirements.\nB. 安全需求的變更。\nChanges in security requirements.\nC. 影響現行營運需求的業務程序變更。\nChanges to business processes that affect current operational requirements.\nD. 管理或法規需求的變更。\nChanges in management or regulatory requirements.\nE. 契約要求的變更。\nChanges to contractual requirements.\nF. 可接受風險等級或標準的變更。\nChanges to acceptable risk levels or criteria.\n(6) 針對資訊安全制度之需要，協調所需之資源。\nCoordinate the required resources based on the needs of the cyber security system.\n(7) 控制措施及有效性評量方式的改善。\nImprovement of control measures and effectiveness evaluation methods:\nA. 評量時應決定執行事項、所需資源、負責人員、完成時間、成果評估方式等項目，以確認資訊安全目標之達成。\nDuring the evaluation, items such as implementation items, required resources, responsible personnel, completion time, and result evaluation methods shall be determined to confirm the achievement of cyber security objectives.\nB. 本實驗室應每年檢視「IMI-NCKU-D-003 資安管理指標暨有效性量測表」之量測執行狀況。\nThe Lab shall inspect the measurement execution status of \" IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form\" every year.\nC. 若「IMI-NCKU-D-003 資安管理指標暨有效性量測表」之量測項目與目標水準有進行調整之需要，可進行討論與改善決議。\nIf there is a need to adjust the measurement items and target levels of \"IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form,\" discuss and improve the resolution.\n5.3 組織間的合作及協調\nCooperation and Coordination among Organizations\n5.3.1 為確保資訊安全事件發生時，儘速執行事件處理，須與權責或外部單位隨時保持聯繫，例如：主管機關、資通安全會報、消防單位等；並建立與組織資訊安全管理制度相關之「IMI-NCKU-D-002 外部單位聯絡清單」。\nIn order to ensure that when a cyber security incident occurs, the incident is handled as soon as possible, it is necessary to remain in contact with authorities and external units at all times, including the competent authority, the cyber security report, the fire department, etc.; and establish and organize an \"IMI-NCKU-D-002 External Contact List\" related to the cyber security management system.\n5.3.2 「IMI-NCKU-D-002 外部單位聯絡清單」每年至少一次由專案經理負責維護，視組織或合約變動適時更新。\nThe \"IMI-NCKU-D-002 External Contact List\" shall be updated by the project manager at least once a year, and revised in due course depending on changes in the organization or contract.\n5.3.3 應隨時與資訊安全技術相關團體維持聯繫，獲取資訊安全技術及產品資訊與知識，以及處理資訊安全事件或執行系統修補資訊等，並將資訊建立於「IMI-NCKU-D-002 外部單位聯絡清單」，由資訊安全小組負責維護更新。\nKeep in touch with groups related to cyber security technology at all times to obtain information and knowledge on cyber security technology and products, as well as to deal with cyber security incidents and implement the information of system patch. The information shall be documented in \"IMI-NCKU-D-002 External Contact List,\" which maintained and updated by the Cyber Security Team.\n5.3.4 參考「IMI-NCKU-B-011 事件管理程序書」與相關權責單位建立通報管道並執行通報作業，聯繫方式應詳列於「IMI-NCKU-D-002 外部單位聯絡清單」。\nRefer to \"IMI-NCKU-B-011 Incident Management Process\" to establish notification channels with relevant responsible units and execute notification operations. The contact information shall be listed in the \"IMI-NCKU-D-002 External Contact List.\"\n5.4 資訊安全目標的達成計畫與量測方式\nCyber Security Target Achievement Plan and Measurement Method\n5.4.1 資訊安全目標應與資訊安全政策一致並可量測，同時應考量適用之資訊安全要求，以及風險評鑑及處理之結果。並將資訊安全目標與相關事項傳達給本實驗室人員、委外廠商與資安作業相關單位，且於定期或組之重大變更時進行更新。\nCyber security objectives shall be consistent with the cyber security policy and must be measurable. At the same time, the applicable cyber security requirements and the results of risk assessment and treatment shall be taken into consideration. Cyber security goals and related matters shall be communicated to the Lab's personnel, outsourced vendors, and cyber security operation related units, and the goals shall be updated regularly or when there are major changes in the organization.\n5.4.2 應定期規劃達成資訊安全目標作業，應包含：\nThe operation to achieve cyber security objectives shall be regularly planned and shall include:\n(1) 相關執行活動或事項。\nRelevant implementation activities or items.\n(2) 所需投入之人員、預算、設備技術與程序表單等資源。\nRequired resources such as personnel, budget, equipment technology, and procedure lists.\n(3) 活動或事項負責人員。\nPersonnel responsible for the activities or items.\n(4) 活動或事項預計完成時間。\nEstimated completion time of activities or items.\n(5) 管理目標是否達成之評估方式。\nEvaluation method of whether management objectives were achieved\n5.4.3 完成上述資訊安全目標達成作業規劃並詳列於「IMI-NCKU-D-003 資安管理指標暨有效性量測表」，由資訊安全小組負責維護更新。\nThe operation plan for achieving the aforementioned cyber security objectives shall be developed and documented in \"IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form,\" which shall be maintained and updated by the Cyber Security Team.\n5.5 專案管理的資訊安全\nCyber Security for Project Management\n5.5.1 無論任何型態的專案，於需求說明書或契約書中，應對資訊安全加以陳述。\nIn any type of project, cyber security shall be addressed in the requirements specification or contract document.\n5.5.2 專案啟始時應執行風險評鑑，以評估專案實施階段可能發生的資訊安全風險。\nRisk assessment shall be carried out at the beginning of the project to assess the cyber security risks that may occur during the project implementation stage.\n5.5.3 資訊安全專案管理之運作應依據專案管理五階段：啟始(Initiating)、規劃(Planning)、執行(Executing)、監控(Monitoring)和結束(Closing)，將資訊安全管理制度規範納入該專案的每一個階段進行控管。\nOperation of cyber security project management shall be based on five phases of project management: Initiating, Planning, Executing, Monitoring, and Closing, and cyber security management system rules shall be included in the project controls at every stage of the Project.\n5.5.4 專案管理應對專案相關人員進行角色界定與責任配置。\nProject management shall define the roles and assign responsibilities of project-related personnel.\n5.6 行動裝置及遠距工作\nMobile Devices and Remote Working\n5.6.1 私人之行動裝置連結本實驗室無線網路，應有正常登錄程序。\nThere shall be a normal login procedure for personal mobile devices to connect to the Lab's wireless network.\n5.6.2 公務之行動裝置不得破解或越獄，程式應於合法官方管道下載。\nSchool-issued mobile devices must not be cracked or jailbroken, and programs shall be downloaded from legitimate official channels.\n5.6.3 勿於公務之行動裝置隨意點選社群網站或即時通訊軟體中之超連結。\nDo not randomly click on hyperlinks in social networking sites or instant messaging software when using official mobile devices.\n5.6.4 未經單位網路管理人員授權許可，禁止執行網路偵測、弱點掃描、封包收集分析等工具軟體。\nWithout the authorization of the department's network management personnel, it is prohibited to execute tools and software such as network detection, vulnerability scanning, and packet collection and analysis.\n5.6.5 可攜式電腦建議安裝防毒軟體，並定期檢查作業系統修正程式與更新病毒碼為最新版本。\nIt is recommended to install antivirus software on portable computers, and regularly check the operating system's repair program and update the virus definitions to the latest version.\n5.6.6 個人專屬行動裝置使用時應謹防資訊外洩或是中毒。\nBeware of information leakage and viruses when using personal mobile devices.\n5.6.7 為確保本實驗室遠距工作之安全，應訂定作業管理規範，以降低遠距工作風險，相關程序與方法請參閱「IMI-NCKU-B-010 遠端存取安全管理程序書」。\nIn order to ensure the security of remote work in the Lab, operation management regulations shall be formulated to reduce the risk of remote work. For related procedures and methods, please refer to \"IMI-NCKU-B-010 Remote Access Security Management Process.\"\n6. 參考文件Reference\n6.1 IMI-NCKU-D-001 資訊安全組織成員表\nIMI-NCKU-D-001 Cyber Security Organization Personnel List\n6.2 IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.3 IMI-NCKU-D-002 外部單位聯絡清單\nIMI-NCKU-D-002 External Contact List\n6.4 IMI-NCKU-D-003 資安管理指標暨有效性量測表\nIMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form\n6.5 IMI-NCKU-B-011 事件管理程序書\nIMI-NCKU-B-011 Incident Management Process\n6.6 IMI-NCKU-B-010 遠端存取安全管理程序書。\nIMI-NCKU-B-010 Remote Access Security Management Process\n\n\n資訊安全組織程序書\nCyber Security Organization Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n資訊安全組織程序書\nCyber Security Organization Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n9\n\n",
    "C:\\Users\\user\\Desktop\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-002_場域人員管理程序書 Field Personnel Management Process_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n場域人員管理程序書\nField Personnel Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-002         Form No.: IMI-NCKU-B-002\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t4\n2.\t適用範圍Scope of Application\t4\n3.\t權責Roles and Responsibilities\t4\n4.\t名詞定義Definition of Terms\t4\n5.\t作業說明Operation Instructions\t5\n6.\t參考文件Reference\t12\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）資訊安全管理制度執行之範圍，達成資安管理制度之目標，並為有效管理本實驗室專案場域之專案中參與人員，在專案執行期間，具備能力與專業知識，遵守專案場域管理與資訊安全要求，熟悉資訊安全程序，避免資訊安全問題，維持專案場域正常運作，特制定本程序。\nTo ensure the scope of the cyber security management system at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and achieve the goals of the security management system, and to effectively manage the participants in the project field of the Lab's project, it is necessary for the participants to possess the required capabilities and professional knowledge, comply with the project field management and cyber security requirements, be familiar with cyber security procedures, avoid cyber security issues, and maintain the normal operation of the project field, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and project field.\n3. 權責Roles and Responsibilities\n3.1  計畫主持人：外部溝通、專案稽核與核可、人員指派。\nProject principal: External communication, project audit and approval, personnel assignment.\n3.2  專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3  行政專員：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4  軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware department: Technology development, patch the program, project schedule planning.\n3.5  測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n4.1  專案人員：本實驗室內部人員與委外廠商。 \nProject personnel: Internal the Lab personnel and outsourced vendors.\n4.2  委外廠商：支援本專案之委外廠商，包含委外廠商之分包商、顧問或代表等。 \nOutsourced vendors: Outsourced vendors who support this project, including subcontractors, consultants, and representatives.\n5. 作業說明Operation Instructions\n5.1  為了解專案場域之範圍與內容，可參考架構如下圖1： \nIn order to understand the scope and content of the project field, please refer to Figure 1 below for the structure:\n\n圖1、場域架構圖範例。\nFigure 1, Example of field architecture diagram.\n\n5.2  本專案之專案人員組織圖參考如下圖2： \nFor the organization chart of project personnel, please refer to Figure 2 below:\n\n圖2、本實驗室專案人員組織圖範例。\n\n\nFigure 2, Example organization chart of the Lab's project personnel.\n\n5.3  本實驗室與專案場域資訊安全政策與承諾\nCyber security policy and commitment of the Lab and project field\n任何指派到專案場域之專案人員應詳知本專案資訊安全政策與承諾與遵守資產擁有者相關要求之職責、政策和程序以及IEC 62443-2-4規範，其中人員包括本專案執行人員、委外廠商、分包商與顧問或代表人員，詳如「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」所示。\nAll personnel assigned to the project field shall be fully aware of the project's cyber security policies, commitments, and the responsibilities, policies, and procedures pertaining to the asset owner as well as the requirements specified in IEC 62443-2-4 standard. The personnel mentioned include project implementers, outsourced vendors, subcontractors, consultants, and representatives, as detailed in \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\".\n5.4  專案人員職務資格要求與職責\nQualification Requirements and Responsibilities of Project Personnel\n所有參與本專案與專案場域之相關專案執行人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，應先經過實驗室安全背景調查(如：人員資料、良民證等)，除具備賦予權責的專業技能與知識外，並需通過IEC 62443教育訓練，其職務資格與職責詳如下表：\nAll personnel involved in this project and the project field, including project executives, outsourced vendors, subcontractors, and consultants or representatives, shall undergo the Lab's security background check (e.g., personnel information, Police Criminal Record Certificate, etc.). In addition to possessing the necessary professional skills and knowledge, they shall also pass IEC 62443 education and training. Job qualifications and responsibilities are detailed in the table below:\n\n表 1、職務資格與權責。\nTable 1, Job qualifications and responsibilities.\nPosition\nQualification\nResponsibilities\n計畫主持人\nProject Principal\n理工博士、年資二十年以上。\nDoctor of science and engineering, more than 20 years of experience.\n外部溝通、挑選合格的人員擔任安全主管，確保自動化系統的安全性，並執行專案稽核與核可。\nExternal communication, selection of qualified personnel as security supervisors, ensuring the security of automated systems, and conducting project audits and approvals.\n專案經理\nProject Manager\n製造資訊背景之碩士、年資超過一年以上、熟悉軟體開發程式語言、具備專案管理能力。\nMaster's degree in Manufacturing Information, more than 1 year of experience, familiarity with software development programming languages, and project management capabilities.\n監督、內外部溝通、時程規劃、風險評估、帳號管理。\nSupervision, internal and external communication, schedule planning, risk assessment, account management.\n行政專員\nAdministrative Commissioner\n學士畢業、精通文書管理程式、具備會計相關知識、熟悉學校作業。\nBachelor's degree, proficient in document management procedures, accounting-related knowledge, familiar with university operations\n內外部溝通、執行行政事務、人事管理事務、教育訓練召集，內部稽核。\nInternal and external communication, executive administrative affairs, personnel management affairs, convening education and training, internal audit.\n軟體工程師\nSoftware Engineer\n製造資訊背景之碩士、熟悉軟體開發程式語言、了解嵌入式設備、知悉工控通訊協定。\nMaster's degree in Manufacturing Information, familiar with software development programming language, understands embedded devices, understands industrial control communication protocols\n技術開發、程式修補、專案進度規劃。\nTechnology development, program repair, project schedule planning.\n測試工程師\nTest Engineer\n製造資訊背景之碩士、熟悉軟體開發程式語言、會使用測試軟體。\nMaster's degree in Manufacturing Information, familiar with software development programming language, able to use testing software\n專案進度規劃、軟體測試、報告測試結果。\nProject schedule planning, software testing, and reporting of test results.\n\n5.5  人員指派辦法\nPersonnel assignment method\n5.5.1 本專案人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，派遣至專案場域前，需了解資產擁有者之政策、程序等要求，並使用「IMI-NCKU-D-007 專案人員評鑑表」評核後合格者，經計畫主持人同意後，由行政專員以書面形式通知資產擁有者，待資產擁有者核准後，始能進入資產擁有者專案場域執行該專案。\nThe project personnel, including project executives, outsourced vendors, subcontractors, consultants, and representatives need to understand the asset owner's policies, procedures, and other requirements before being dispatched to the project field, and use the \"IMI-NCKU-D-007 Project Personnel Evaluation Form.\" After the evaluation, if the project principal approves, the administrative commissioner shall notify the asset owner in writing. After the asset owner approves, the personnel can enter the asset owner's project field for execution the project.\n5.5.2 派遣至本專案人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，應遵守資產擁有者於場域的各項資訊安全要求的政策和程序，如：變更管理、工作許可等，並提供背景資料與犯罪紀錄調查（如，良民證），經行政專員確認符合本專案人員條件後，簽署「IMI-NCKU-D-005 委外廠商與人員保密切結書」作為依據。\nAll personnel assigned to the project, including executing personnel, outsourced vendors, subcontractors, consultants, and representatives, shall comply with the policies and procedures of the asset owner's various cyber security requirements in the field, such as management of changes (MoC), permit to work (PtW), etc., and shall provide background information and criminal record investigation (such as Police Criminal Record Certificate). After the administrative commissioner confirms that the person meets the requirements for project personnel, they must sign the \"IMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\" as the basis.\n5.6  人員教育訓練\nPersonnel education and training\n為促使本專案執行人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，迅速了解專案場域業務狀況進而提高工作效能，由計畫主持人授權行政專員，向專案人員說明本專案之運作，並需配合資產擁有者政策、程序、作業標準以及資料保密等要求，進行相關訓練，促使人員於最短時間內能適應並勝任。\nIn order to promote the implementation of the project and help executing personnel, outsourced vendors, subcontractors, consultants, and representatives to quickly understand the business status of the project field and improve work efficiency, the project principal authorizes the administrative commissioner to explain project operations to the project personnel, and shall cooperate with the asset owner's policies, procedures, operating standards, and data confidentiality requirements, to conduct relevant training to enable personnel to swiftly adapt and gain competence.\n5.6.1 本專案人員應瞭解本專案任何變更，應依據「IMI-NCKU-B-003 變更管理程序書」進行變更申請，由資產擁有者同意後，使得進行變更。\nThe project personnel shall be aware of any changes in the project, and shall apply for changes in accordance with the \"IMI-NCKU-B-003 Change Management Process\", and make changes after the asset owner agrees.\n5.6.2 行政專員負責：每年招開工控資安教育訓練課程，可以上課、會議、實作等方式自行辦理訓練，並於「IMI-NCKU-D-004 人員資料表」中登錄。\nThe administrative commissioner is responsible for conducting industrial automation and control system cyber security education and training courses every year, in the form of classes, meetings, implementation, etc., and shall document it in the \"IMI-NCKU-D-004 Personnel Data Sheet\".\n5.6.3 視需要派人參加外部資安相關訓練，由受訓人員辦理報名手續準時出席。\nIf necessary, personnel shall be sent to participate in external cyber security related training, and the trainees shall go through the registration procedures and attend on time.\n5.6.4 專案場域自訓之訓練教材以相關品質文件、作業標準為主，講師由專案場域資深人員或曾接受過相關訓練之人員擔任。\nThe training materials for project field self-training are mainly based on relevant quality documents and operating standards, and the lecturers are senior personnel in the project field or personnel who have received relevant training.\n5.6.5 外部受訓所取得之證書，正本自存，影印本與「IMI-NCKU-D-004 人員資料表」一併存查。\nThe original of the certificates obtained from external training shall be kept on file by self, and the photocopies shall along with the \"IMI-NCKU-D-004 Personnel Data Sheet\" for reference.\n5.6.6 為管理訓練執行情形，應將上述各類訓練資料於訓練結束後於由行政專員記錄於「IMI-NCKU-D-004 人員資料表」中。\nIn order to manage the implementation of the training, the aforementioned training data shall be recorded in the \"IMI-NCKU-D-004 Personnel Data Sheet\" by the administrative commissioner after the training is over.\n5.7  人員能力資格管理考核\nPersonnel capability qualification management assessment\n5.7.1 人員派遣前應通過相關技術與工控資訊安全能力考核，使用「IMI-NCKU-D-007 專案人員評鑑表」進行考核，考核資料應與「IMI-NCKU-D-004 人員資料表」一併存查。\nPersonnel shall pass the relevant technology and industrial automation and control system cyber security capability assessment before dispatch, and use the \"IMI-NCKU-D-007 Project Personnel Evaluation Form\" for assessment. The assessment data shall be consistent with the \"IMI-NCKU-D-004 Personnel Data Sheet\" and both forms shall be kept together for inspection.\n5.7.2 每年應針對工控資訊安全至少進行一次內部或外部教育訓練，每2年應進行至少一次能力考核。\nAt least one internal or external education and training for industrial automation and control system cyber security shall be conducted every year, and at least one ability assessment shall be conducted every 2 years.\n5.8  委外廠商人員資格審查程序\nQualification review procedures for outsourced vendors\n5.8.1 專案場域因技術需求，需引用委外廠商，應經過資產擁有者同意始能派遣，詳見「IMI-NCKU-B-004 委外廠商管理程序書」。\nDue to the technical requirements of the project field, the outsourced vendors need to be cited, and the dispatch shall be approved by the asset owner. For details, see \"IMI-NCKU-B-004 Outsourced Vendors Management Process\".\n5.9  人員變更管理\nPersonnel Change Management\n5.9.1 本專案團隊因人員或技術等因素產生異動，應依據「IMI-NCKU-B-003 變更管理程序書」進行變更申請，若為人員離開本專案，需由行政專員以E-mail正式通知資產擁有者，且於該人員之「IMI-NCKU-D-004 人員資料表」中述明離開專案日期。\nWhen the project team changes due to factors such as personnel or technology, the team shall apply for changes in accordance with \"IMI-NCKU-B-003 Change Management Process\". If a person leaves the project, the administrative commissioner must formally notify the asset owner via e-mail, and state the date of leaving the project in the \"IMI-NCKU-D-004 Personnel Data Sheet\" of the personnel.\n5.9.2 本專案團隊異動經完成變更程序後，行政專員應以書面形式記錄於「IMI-NCKU-D-006 人員異動交接清單」，並重新派遣具該職位能力且獲得資格之人員，由資產擁有者同意後，始能進入專案場域執行該專案。\nAfter processing of the changes to the project team has been completed, the administrative commissioner shall record it in the \"IMI-NCKU-D-006 The Change of Personnel List\" in written form, and dispatch new qualified personnel with the ability for the position; the new personnel may access the project field to execute the project after the asset owner approves.\n5.10  溝通管理\nCommunication management\n5.10.1 本實驗室應與資產擁有者確認提供之自動化解決方案是否符合IEC 62443-2-4要求。\nThe Lab shall confirm with the asset owner whether the provided automation solution complies with the requirements of IEC 62443-2-4.\n5.10.2 本實驗室應將自動化解決方案中IACS的安全觀點傳達予資產擁有者及相關人員。\nThe Lab shall communicate the security perspective of IACS in automation solutions to asset owners and related personnel.\n5.10.3 本實驗室應確保所提供的服務符合資產擁有者的相關規定，例如：IEC 62443-2-4要求與本實驗室內部IACS的安全要求。\nThe Lab shall ensure that its services provided comply with the relevant regulations of the asset owner, such as the requirements of IEC 62443-2-4 and the Lab's internal IACS security requirements.\n5.10.4 本實驗室應與資產擁有者確認合約內的條文，避免對於合約內容產生誤解，對於委外廠商也需確認是否符合相關要求。\nThe Lab shall confirm the terms of the contract with the asset owner to avoid misunderstandings about the content of the contract. For outsourced vendors, it is also necessary to confirm whether they meet the relevant requirements.\n5.10.5 若有需追蹤事項，需經由人員管理會議或線上會議決定，指派專人建立窗口，負責執行與追蹤，並回報予專案經理直至追蹤事項結束。\nIf there is an item that needs to be tracked, it needs to be decided through a personnel management meeting or an online meeting, and a dedicated person shall be assigned to serve as the contact window, take responsibility for implementation and tracking, and report to the project manager until the end of the tracked item.\n6. 參考文件Reference\n6.1  IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.2  IMI-NCKU-D-007 專案人員評鑑表\nIMI-NCKU-D-007 Project Personnel Evaluation Form\n6.3  IMI-NCKU-D-005 委外廠商與人員保密切結書\nIMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\n6.4  IMI-NCKU-B-003 變更管理程序書\nIMI-NCKU-B-003 Change Management Process\n6.5  IMI-NCKU-D-004 人員資料表\nIMI-NCKU-D-004 Personnel Data Sheet\n6.6  IMI-NCKU-B-004 委外廠商管理程序書\nIMI-NCKU-B-004 Outsourced Vendors Management Process\n6.7  IMI-NCKU-D-006 人員異動交接清單\nIMI-NCKU-D-006 The Change of Personnel List\nField Personnel Management Procedures\nFile No.\nIMI-NCKU-B-002\nConfidentiality Level\nConfidential\nVersion\n1.2\n\n\n8\n\n\n\n\n\n場域人員管理程序書\nField Personnel Management Process\n文件編號\nForm No.\nIMI-NCKU-B-002\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n\n\n場域人員管理程序書\nField Personnel Management Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\nField Personnel Management Procedures\nFile No.\nIMI-NCKU-B-002\nConfidentiality Level\nConfidential\nVersion\n1.2\n\n\n",
    "C:\\Users\\user\\Desktop\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-004_委外廠商管理程序書 Outsourced Vendors Management Process_0705修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-004         Form No.: IMI-NCKU-B-004\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t1\n4.\t名詞定義Definition of Terms\t3\n5.\t作業說明Operation Instructions\t3\n6.\t參考文件Reference\t10\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）與專案場域之委外廠商，於委外執行前或委外契約履行時，其提供之交付標的與服務作業均能符合工業自動化與控制系統資訊安全管理規範，特制定本程序書。\nTo ensure that the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and the outsourced vendors for project fields comply with the industrial automation and control system cyber security management specifications for the verification of deliverables and service operations provided prior to or during the execution of outsourcing contracts, this process is hereby established.\n2. 適用範圍Scope of Application\n2.1 適用於本實驗室與專案場域之相關委外服務項目，包括：\nOutsourced Services of the Lab and the project field, including:\n2.1.1 工業自動化設備。\nIndustrial automation equipment.\n2.1.2 主機系統委外採購與維護。\nOutsourced procurement and maintenance of the host system.\n2.1.3 網路相關硬體設備委外採購與維護。\nOutsourced procurement and maintenance of network-related hardware equipment.\n2.1.4 應用系統套裝軟體客製化及維護\nCustomization and maintenance of application system package software.\n2.1.5 專業顧問服務委外\nOutsourced professional consulting services.\n3. 權責Roles and Responsibilities\n3.1 專案團隊︰負責依據本程序書之規定，提出適當之安全需求及擬定與廠商服務相關合約內容，並確實在合約中訂定保密條款。\nProject team: Responsible for proposing appropriate security requirements and formulating the content of contracts related to vendors services, in accordance with the provisions of this process document, and ensuring the inclusion of confidentiality clauses in the contracts.\n3.2 業務權責單位Business Authority and Responsible Unit:\n3.2.1 負責審查專案團隊所擬定之合約，確認合約內容無違反本實驗室應遵循之相關規定或傷害本實驗室之權益。\nResponsible for reviewing the contract drawn up by the project team, confirming that the content of the contract does not violate the relevant regulations of the Lab that shall be followed or damage the rights and interests of the Lab.\n3.2.2 對於提供委外服務之廠商遴選，應符合專案團隊所提出之安全需求及採購辦法之規範。\nThe selection of the vendors that provide outsourced service shall comply with the security requirements and procurement methods proposed by the project team.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 作業說明Operation Instructions\n5.1 一般條款\nGeneral terms\n5.1.1 委外廠商及其服務人員，均應遵守專案場域之「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」、法規與作業程序。\nThe outsourcing vendors and their service personnel shall comply with the \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy,\" regulations, and operating procedures of the project field.\n5.1.2 委外廠商應負責系統維護、聯絡窗口及電話詢答服務，並解決系統相關事宜，並配合本實驗室相關程序辦理異常排除及通報事宜，如必要時應提供駐點服務。\nThe outsourcing vendors shall be responsible for system maintenance, contact windows and telephone inquiry service, and solve system-related matters, and cooperate with the relevant procedures of the Lab to handle abnormalities and notification matters, and provide on-site services if necessary.\n5.1.3 委外廠商應遵守本實驗室之相關規定，並簽訂「IMI-NCKU-D-005 委外廠商與人員保密切結書」。\nThe outsourcing vendors shall comply with the relevant regulations of the Lab, and sign the \"IMI-NCKU-D-011 Confidentiality Agreement for External Suppliers and Personnel\".\n5.1.4 委外廠商履行合約提供使用之軟體，均需為合法軟體，並不得違反智慧財產權之規定，如有違反事情發生，委外廠商須承擔所有法律責任。\nThe software provided by the outsourcing vendors to perform the contract must be legal software and must not violate the provisions of intellectual property rights. If any violation occurs, the outsourcing vendors must assume all legal liability.\n5.1.5 委外廠商使用之工具軟體及處理作業之執行紀錄，本實驗室有權進行稽核，廠商不得異議。\nThe Lab has the right to audit the execution records of the tool software and processing operations used by outsourcing vendors, and the vendors shall not object.\n5.1.6 委外廠商應留存異常處理紀錄，本實驗室得視需要查核。\nThe outsourcing vendors shall keep abnormal handling records, which may be checked by the Lab as needed.\n5.1.7 委外廠商所交付之標的物如侵害第三人合法權益時，應由承包廠商負責處理並承擔一切法律責任。\nThe contracting party shall be responsible for handling and assuming all legal liabilities when the deliverables provided by the outsourcing vendors infringe upon the legitimate rights and interests of third parties.\n5.1.8 委外廠商如因其員工執行業務之過失，造成本實驗室損失或傷害，委外廠商需負損害賠償責任。\nIf the outsourcing vendors' employees causes loss or injury to the Lab due to the negligence in the course of business, the outsourcing vendors shall be liable for damages.\n5.1.9 委外廠商相關系統之開發或負責人員離職時，應繳回其所借用之設備、軟體及作業權限。\nThe equipment, software, and operating license loaned to the outsourcing vendors shall be returned when the developer or other responsible personnel of the relevant system of the outsourcing vendors leave the job.\n5.1.10 委外廠商人員於支援業務時所獲知敏感等級以上資訊，不得對外透露。\nPersonnel from outsourced vendors, while providing support services, shall not disclose sensitive information classified at or above the designated sensitivity level to external parties.\n5.1.11 委外廠商如知悉或觀察到本實驗室系統之任何可疑的資訊安全弱點應立即通報本實驗室，並保留相關證據。\nIf the outsourcing vendors knows or observes any suspicious cyber security weaknesses of the Lab system, they shall immediately report to the Lab and retain relevant evidence.\n5.2 委外廠商要求與評估作業\nRequirements and assessment for outsourcing vendors\n5.2.1 業務委外之需求，應參考專案場域需求規格，並請委外廠商提供適當之服務建議書。\nThe requirements for business outsourcing shall be based on the project field requirements specification, and the outsourcing vendor shall be requested to provide a suitable service proposal.\n5.2.2 軟體委外採購時，得將「IMI-NCKU-D-009 廠商軟體評估表」列為建議書徵求說明文件之附件，以評估廠商所提供軟體之安全性。\nWhen software is outsourced, the \"IMI-NCKU-D-009 Vendor Software Evaluation Form\" may be listed as an attachment to the proposal request document to evaluate the security of the software provided by the vendor.\n5.2.3 硬體委外採購時，得將「IMI-NCKU-D-010 廠商硬體評估表」列為建議書徵求說明文件之附件，以評估廠商所提供硬體之安全性。\nWhen hardware is outsourced, the \"IMI-NCKU-D-010 Vendor Hardware Evaluation Form\" may be listed as an attachment to the proposal request document to evaluate the safety of the hardware provided by the vendor.\n5.2.4 委外廠商訂定資訊安全需求：\nThe cyber security requirements of the outsourcing vendor:\n(1) 委外廠商應提供參與本案相關人員之學歷、工作資格及在職證明文件。\nThe outsourcing vendor shall provide the academic qualifications, work qualifications, and on-the-job certification documents of the relevant personnel involved the project.\n(2) 委外廠商需保證與委外作業有關的各方（包括分包商）都應遵守資訊安全法令規定。\nThe outsourcing vendors need to ensure that all parties (including subcontractors) related to outsourced operations shall comply with cyber security laws and regulations.\n(3) 委外廠商於本專案發生重大資訊安全威脅時，應配合提供維護服務。\nThe outsourcing vendor shall provide maintenance services when a major cyber security threat occurs in the project.\n(4) 對於專案中資訊安全之需求，本實驗室保有查核之權利。\nThe Lab reserves the right to review the cyber security requirements in the project.\n(5) 本實驗室為落實委外之管理監督，得定期對委外廠商進行查核作業。\nIn order to implement the management and supervision of outsourcing, the Lab may regularly review the outsourcing vendors.\n5.3 資訊系統委外服務提出\nRequest for outsourcing of information system services\n5.3.1 專案團隊因業務需求提出資訊委外服務，應適當評估資訊委外之必要性。\nThe project team shall assess the necessity of outsourcing information services based on business requirements.\n5.3.2 若為主機系統之委外採購，專案團隊應對系統需求做適當規劃，以確保足夠的電腦處理及儲存容量。\nFor the outsourced procurement of the mainframe system, the project team shall make proper planning for the system requirements to ensure sufficient computer processing and storage capacity.\n5.4 資產識別與風險評鑑作業\nAsset identification and risk assessment operations\n5.4.1 專案團隊應依據「IMI-NCKU-B-006 威脅與風險評鑑程序書」，依照委外標的之資訊資產價值、可用性、機密性、完整性等級，適當評估其可能之威脅及弱點。\nThe project team shall evaluate the potential threats and vulnerabilities based on the value, availability, confidentiality, and integrity levels of the outsourced information assets, in accordance with the \"IMI-NCKU-B-006 Threat and Risk Assessment Management Process\".\n5.5 選擇或新增安全需求Select or add security requirements\n5.5.1 專案團隊依據上述風險評鑑結果，進行風險管理作業，選擇適用之安全需求項目，明訂於合約之中。\nThe project team performs risk management operations based on the above risk assessment results, selects applicable security requirements items, and clearly records them in the contract.\n5.6 硬體採購與維護Hardware procurement and maintenance\n5.6.1 廠商應提供與設備主機之架構、操作、管理、維護等相關之操作手冊、文件與技術支援，如必要亦應提供教育訓練課程。\nThe vendor shall provide operation manuals, documents and technical support related to the structure, operation, management and maintenance of the equipment host, and shall also provide education and training courses if necessary.\n5.7 系統帳號管理System account management\n5.7.1 委外系統資料、軟體或作業系統最高權限帳號、資料庫最高權限帳號，應由本實驗室計畫主持人或專案經理保管，不得直接授與委外廠商使用。\nThe outsourced system data, software or operating system account with the highest authority, and the database account with the highest authority shall be kept by the project principal or project manager of the Lab, and shall not be directly granted to the outsourcing vendors for use.\n5.7.2 委外廠商之人員如因作業需求，需對本實驗室系統進行存取，應遵循相關安全管理規範，並由本實驗室人員填寫「IMI-NCKU-D-011 場域服務變更申請表」代為提出申請。\nIf the personnel of the outsourcing vendor need to access the Lab system due to operational requirements, they shall follow the relevant security management regulations, and submit an \"IMI-NCKU-D-011 Change of Field Service Application Form\" on behalf of the Lab personnel.\n5.7.3 「IMI-NCKU-D-011 場域服務變更申請表」中應載明作業需求內容、所需權限、帳號有效時間，經由計畫主持人核准後，由專案經理依照所需權限及帳號有效時間，建立獨立之帳號供委外廠商人員使用。\nThe \"IMI-NCKU-D-011 Change of Field Service Application Form\" shall specify the content of the operation requirements, the required authority, and the valid time of the account. After approval by the project principal, the project manager shall create a separate account for the outsourcing vendor personnel according to the required authority and account validity time.\n5.7.4 委外廠商人員對於系統帳號應善盡保管之責，系統帳號不得任意交由非作業相關人員使用。\nOutsourced personnel shall be responsible for properly safeguarding system accounts, and system accounts shall not be used by individuals unrelated to the operations.\n5.7.5 委外廠商人員對於系統之操作，本實驗室各系統管理者應盡監督之責，委外廠商人員不得從事非工作範圍內之操作。各系統管理者並應於委外廠商人員完成工作後檢視系統紀錄。\nThe system managers of the Lab shall be responsible for supervising the operation of the system by the personnel of the outsourcing vendors, and the personnel of the outsourcing vendors shall not engage in operations that are not within the scope of work. Each system manager shall also check the system records after the outsourced personnel complete the work.\n5.8 緊急應變計畫Emergency response plan\n5.8.1 資訊作業若涉及本實驗室之專案業務時，得要求委外廠商配合本實驗室定期進行業務永續運作計畫，針對委外標的建立緊急應變計畫，並定期進行測試；若該委外案件屬於整體委外者，應以委外系統及資料兩者中最高資訊資產價值衡量演練週期。\nWhen it comes to projects involving the operations of the Lab, the outsourcing vendors may be required to cooperate with the Lab in developing a business continuity plan for sustainable operations. They shall establish an emergency response plan for the outsourced scope and conduct regular testing. In the case of comprehensive outsourcing, the exercise cycle shall be determined based on the higher value of either the outsourced systems or data as information assets.\n5.8.2 備援需求：依據不同資訊資產價值及可用性等級，考量其備援需求，必要時，得建立異地備援機制。\nBackup requirements: According to the value and availability level of different information assets, consider their backup requirements, and establish a remote backup mechanism when necessary.\n5.9 可攜式電腦及儲存媒體管理\nPortable computer and storage media management\n5.9.1 委外廠商如需攜帶可攜式電腦或儲存媒體如磁片、光碟、隨身碟、外接式硬碟等進入專案場域使用，需經陪同之本實驗室人員同意。\nIf outsourcing vendors need to bring portable computers or storage media such as disks, CDs, flash drives, external hard drives, etc. into the project field for use, it must obtain the consent of the accompanying Lab's personnel.\n5.9.2 廠商維修人員，當進入專案場域並使用可攜式電腦或儲存媒體時，需有監控設備進行監控或本實驗室人員全程陪同。\nWhen the maintenance personnel of the vendor enter the project field and use portable computers or storage media, it must be monitored by monitoring equipment or accompanied by the Lab's personnel throughout the process.\n5.10 例外作業Exceptional work\n資訊委外服務之專案團隊應遵循本程序書之規範，提出適當安全需求項目。但若因成本、時效、委外服務之特性、委外廠商之局限性等相關因素之考量，而致本程序書所規範之安全需求無法完全適用時，專案團隊得以簽呈方式，提出其他適切之安全需求與規劃，提報計畫主持人簽核。\nThe project team of information outsourcing service shall follow the specification of this process and put forward appropriate security requirement. However, if due to the consideration of related factors such as cost, timeliness, characteristics of outsourced services, and limitations of outsourced vendors, the security requirements specified in this process cannot be fully applied, the project team can submit other appropriate security requirements and plans to the project principal for approval.\n5.11 服務變更管理Service change management\n委外廠商所提供之相關服務內容如有變更，需經由專案經理以簽呈方式通報計畫主持人，並視需求附上相關風險評鑑之佐證資料，經計畫主持人核可後，方能進行變更，其服務變更內容如下：\nAny changes to the services provided by the outsourced vendor shall be communicated to the project principal by the project manager through a signed document. The document shall include relevant risk assessment supporting materials as required. After approval by the project principal, the changes can be implemented. The service changes are as follows:\n5.11.1 系統網路架構改變。\nSystem network architecture changes.\n5.11.2 使用新的技術。\nUse of new technologies.\n5.11.3 產品轉換至新版本。\nProduct transition to a new version.\n5.11.4 新的開發工具及環境。\nNew development tools and environment.\n5.11.5 服務設備之搬遷。\nRelocation of service equipment.\n5.11.6 更換服務提供廠商或服務人員。\nChange of service provider or service personnel.\n6. 參考文件Reference\n6.1 IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.2 IMI-NCKU-D-005 委外廠商與人員保密切結書\nIMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\n6.3 IMI-NCKU-B-006 威脅與風險評鑑程序書\nIMI-NCKU-B-006 Threat and Risk Assessment Management Process\n6.4 IMI-NCKU-D-009 廠商軟體評估表\nIMI-NCKU-D-009 Vendor Software Evaluation Form\n6.5 IMI-NCKU-D-010 廠商硬體評估表\nIMI-NCKU-D-010 Vendor Hardware Evaluation Form\n6.6 IMI-NCKU-D-011 場域服務變更申請表\nIMI-NCKU-D-011 Change of Field Service Application Form\n\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n文件編號\nForm No.\nIMI-NCKU-B-004\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n文件編號\nForm No.\nIMI-NCKU-B-004\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n9\n\n",
    "C:\\Users\\user\\Desktop\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-003_變更管理程序書 Change Management Process_0704修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n變更管理程序書\nChange Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-003         Form No.: IMI-NCKU-B-003\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.09\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Content\n1.\t目的Purpose\t4\n2.\t適用範圍Scope of Application\t4\n3.\t權責Roles and Responsibilities\t4\n4.\t名詞定義Definition of Terms\t4\n5.\t作業說明Operation instruction\t5\n6.\t參考文件Reference\t8\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）資訊安全管理制度執行之範圍，達成資安管理制度之目標，並為有效管理專案場域之專案系統變更及評估影響，在該專案執行期間，提供資料變更請求獲得妥善管理、追蹤與實施之資訊環境，並符合相關法規之要求，使其免於遭受內、外部的蓄意或意外之威脅避免資訊安全問題，特制定本程序書。\nTo ensure the scope of the cyber security management system implementation at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\"), and achieve the objectives of the security management system, as well as effectively manage system changes and assess their impact within the project in the project field. During the execution of the project, to provide proper management, tracking, and implementation of data change requests in the cyber environment, in compliance with relevant regulations, to prevent cyber security issues from intentional or unintentional threats, both internal and external, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and the project field.\n3. 權責Roles and Responsibilities\n3.1 計畫主持人：外部溝通、人員指派。\nProject principal: External communication, personnel assignment.\n3.2 專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3 行政經理：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4 軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware Department: Technology development, patch the program, project schedule planning.\n3.5 測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n4.1 專案人員：本實驗室與專案場域之內部人員與委外廠商。\nProject Personnel: Internal the Lab personnel and outsourced vendors.\n4.2 委外廠商：支援本專案之委外廠商，包含委外廠商之分包商、顧問或代表等。\nOutsourced vendors: Outsourced vendors who support this project, including subcontractors, consultants, and representatives.\n4.3 變更：係指當管理本專案作業、技術、工程和原有作業規範或設計規範有所改變或偏離，且此類改變或偏離未曾執行或發生過，或雖曾發生但無紀錄或書面資料可供依循者。\nChange: Refers to changes or deviations in the operation, technology, engineering, and original operating specifications or design specifications of the management project, wherein such changes or deviations have either not been implemented or occurred, or have occurred but there is no record or written information available to follow.\n5. 作業說明Operation instruction\n5.1 啟動變更請求Initiate a change request\n當變更提出者參照識別變更來源所定義的分類去執行變更請求管理，需填寫「IMI-NCKU-D-008 專案場域變更申請表」。\nWhen the change initiator refers to the classification defined by the change source to execute change request management, the \"IMI-NCKU-D-008 Project Field Change Request Form\" shall be filled out.\n5.2 評估變更請求Assessing the request for change\n當提出變更申請後，由專案經理進行識別影響項目、進行對影響的風險評估、提出變更規劃書（含程序書、測試、人員訓練等）後，由計畫主持人做最終決斷，並提報資產擁有者。\nAfter submitting a change request, the project manager shall identify the impacted items, perform a risk assessment on the impacts, and develop a change plan (including process, testing, and personnel training). The final decision shall be made by the project principal, who shall then report to the asset owner.\n5.3 變更請求通知Change request notification\n經計畫主持人授權後，由專案經理向資產擁有者報告變更項目、變更順序以及人員訓練規劃，且應得到資產擁有者核准，若資產擁有者不核准，則需告知相關風險，資產擁有者之建議應紀錄於該「IMI-NCKU-D-008 專案場域變更申請表」。\nAfter being authorized by the project principal, the project manager contacts the asset owner to report the change items, change sequence, and personnel training plan, which must be approved by the asset owner. If the asset owner does not approve, it shall be informed of the relevant risks, and the recommendations shall be recorded in the \"IMI-NCKU-D-008 Project Field Change Request Form\".\n5.4 安全檢查Security check\n當變更完成準備運轉前，應執行測試前安全檢查，避免惡意程式影響場域運作並且有適當的修補措施，應參考「IMI-NCKU-B-013 惡意軟體防護管理程序」與「IMI-NCKU-B-014 修補管理程序書」進行，確認完成下列事項確認無誤後，始可作業：\nWhen the change is complete and prepare for operation, a pre-test security check shall be performed to prevent malicious programs from affecting field operations, and appropriate patch measures shall be taken. It shall be implemented by refer to \"IMI-NCKU-B-013 Malware Protection Management Process\" and \"IMI-NCKU-B-014 Patch Management Process\". After confirming that the following items are completed and correct, the operation can be performed:\n5.4.1 應執行之風險評估及所提之改善建議均已完成。\nThe risk assessment that shall be performed and the proposed improvement recommendations have been completed.\n5.4.2 場域施工與建置均符合設計之規格。\nField establishment and construction are in compliance with the design specifications.\n5.4.3 操作、維修、異常及緊急應變處理等程序均已完成修正更新。\nOperation, maintenance, abnormality and emergency response procedures have been corrected and updated.\n5.4.4 確認變更影響所及之人員均完成告知或訓練。\nConfirm that all personnel affected by the change have been notified or trained.\n5.4.5 相關的圖樣、作業程序、操作參數等文件資料均已修訂更新。\nRelevant documents such as drawings, operating procedures, and operating parameters have been revised and updated.\n5.4.6 上述所有項目經確認無誤後，始可作業。\nAfter all the above items are confirmed to be correct, the operation can be started.\n5.5 人員告知與教育訓練Personnel notification and training\n告知或訓練之目的在於確保相關人員能安全的操作變更後之設備、設施或程序，並能熟練的處理任何可能發生之異常或緊急狀況。因此，對於變更影響所及之人員，包含操作、維修保養、承攬等人員，應於變更正式啟用前告知修改之相關事項或施予必要之訓練，以降低因變更而引起之風險，人員訓練應依據「IMI-NCKU-B-002 場域人員管理程序書」進行。\nThe purpose of notification or training is to ensure that the relevant personnel can safely operate the changed equipment, facilities, or procedures, and proficiently handle any potential abnormalities or emergencies that may occur. Therefore, for the personnel affected by the change, including operators, maintenance, contractors, etc., they shall be notified of the relevant items of the modification or given necessary training before the change is official opening, so as to reduce the risks associated with the change. Personnel training shall be conducted according to \"IMI-NCKU-B-002 Field Personnel Management Process\".\n5.6 變更請求追蹤Change Request Tracking\n監督變更進度、監督變更狀態、追蹤變更直到關閉。若有需追蹤事項，需經由內部會議決定，並指派專人負責執行，由專案經理進行追蹤，至追蹤事項結束。變更正式使用後，如確認為永久變更，其相關作業管制標準書，應於三個月內修改完成，並實施教育訓練，並記錄存查。\nMonitor change progress, monitor change status, track changes until closure. If there is an item that needs to be tracked, it needs to be decided by an internal meeting; a dedicated person must be assigned to be responsible for the implementation and tracking by the project manager until the end of the tracking event. After the change is official implemented, if it is confirmed as a permanent change, the relevant operation control standard shall be revised and completed within 3 months, and education and training shall be implemented, and records shall be kept for inspection.\n5.7 完成變更後通知Notification after completion of changes\n以上相關作業均已完成後，應以E-mail或其他適當的方式通知予資產擁有者作為正式通知。\nAfter the aforementioned operations have been completed, the asset owner shall be formally notified via e-mail or any other appropriates means of communication.\n6. 參考文件Reference\n6.1 IMI-NCKU-D-008 專案場域變更申請表\nIMI-NCKU-D-008 Project Domain Change Application Form\n6.2 IMI-NCKU-B-013 惡意軟體防護管理程序書\nIMI-NCKU-B-013 Malware Protection Management Process\n6.3 IMI-NCKU-B-014 修補管理程序書\nIMI-NCKU-B-014 Patch Management Process\n6.4 IMI-NCKU-B-002 場域人員管理程序書\nIMI-NCKU-B-002 Field Personnel Management Process\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n8\n\n\n\n\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n\n\n1\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n",
    "C:\\Users\\user\\Desktop\\VScode\\test\\成功大學送稽核版\\SP.01\\IMI-NCKU-A-001_工業自動化與控制系統資訊安全政策 Industrial Automation and Control System Cyber Security Policy_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：一般                      Level of Confidentiality: Normal\n文件編號：IMI-NCKU-A-001          Form No.: IMI-NCKU-A-001\n版    次：1.2                       Version: 1.2\n發行日期：2023.05.20                 Issue Date: 2023.05.20\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t2\n4.\t名詞定義Definition of Terms\t2\n5.\t資訊安全目標The Targets of the Cyber Security\t2\n6.\t責任Responsibilities\t3\n7.\t審查Review\t3\n8.\t實施Implementation\t3\n9.\t參考文件Reference\t4\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）與專案場域執行之專案（以下簡稱本專案）所屬資訊資產可用性、機密性與完整性，並符合相關法規之規範要求，使其免於遭受內、外部的蓄意或意外之威脅，並衡酌本實驗室之業務需求，有效落實專案場域之資安措施，特制定本政策以玆遵循。\nTo ensure the availability, confidentiality, and integrity of information assets belonging to the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and the projects executed within the project field (hereinafter referred to as \"the Project\"), and to comply with relevant regulatory requirements, safeguarding them against intentional or unintentional internal and external threats, while considering the operational needs of the Lab, this policy is hereby established for effective implementation of cyber security measures within the project field.\n2. 適用範圍Scope of Application\n本實驗室所提供工業自動化與控制系統之專案場域相關人事物皆適用。\n工業自動化與控制系統資訊安全標準IEC 62443-2-4中12項安全計畫(Security Programs, SP)規範事項涵蓋範圍如下：\nThis policy is applicable to all personnel, events, and objects related to industrial automation and control system projects provided by the Lab.\nThe scope of the 12 Security Program (SP) requirements in the accordance with IEC 62443-2-4 is as follows:\n2.1 人員安全管理政策與執行\nPersonnel Safety Management Policy and Implementation\n2.2 場域安全服務強化與執行\nField Security Service Strengthening and Implementation\n2.3 場域安全架構設計與執行\nField Security Architecture Design and Implementation\n2.4 網路通訊安全設計與執行\nNetwork Communication Security Design and Implementation\n2.5 安全儀控系統設計與執行\nSafety Instruments Systems Design and Implementation\n2.6 組態管理與執行\nConfiguration Management and Execution\n2.7 遠端存取管理與執行\nRemote Access Management and Execution\n2.8 資訊安全事件管理與執行\nCyber Security Incident Management and Execution\n2.9 帳戶管理與執行\nAccount Management and Execution\n2.10 惡意程式防護管理與執行\nMalware Protection Management and Execution\n2.11 修補程式管理與執行\nPatch Management and Execution\n2.12 備份還原管理與執行\nBackup and Restore Management and Execution\n3. 權責Roles and Responsibilities\n本實驗室與專案場域負責執行專案之內部人員、委外服務廠商與訪客皆應遵守本政策。\nThe internal personnel, outsourced service providers, and visitors of the Lab and the project field who are responsible for implementing the project shall abide by this policy.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 資訊安全目標The Targets of the Cyber Security\n維護本實驗室所提供專案場域之資訊資產正常運作，防止資訊或資訊系統受未經授權之存取、使用、控制、洩漏、破壞、竄改、銷毀或其他侵害，並確保其資產之可用性、完整性與機密性，且所有專案團隊人員應共同努力達成下列目標：\nIn order to maintain the normal operation of information assets in the project field provided by the Lab, prevent information or information systems from unauthorized access, use, control, leakage, destruction, tampering, destruction or other infringements; and ensure the availability, integrity and confidentiality of their assets, all project team personnel shall work together to achieve the following goals:\n5.1 保護本實驗室與專案場域資訊業務活動，避免未經授權的存取。\nProtect the Lab and project field cyber operation activities to avoid unauthorized access.\n5.2 保護本實驗室與專案場域資訊業務活動，避免未經授權的修改，確保其正確且完整。\nProtect the Lab and project field cyber operation activities to avoid unauthorized modification, and ensure its correctness and completeness.\n5.3 依照客戶對於工業自動化資訊安全要求，建立工業自動化資訊安全專案場域服務，進行專案場域風險管理，並依循IEC 62443-2-4需求項目落實品質管理循環(PDCA)精神，以持續改善工業自動化資訊安全管理系統之有效性。\nAccording to the client's requirements for industrial automation cyber security, establish industrial automation cyber security services for the project field, conduct risk management for the project field, and follow the IEC 62443-2-4 requirements items to implement the spirit of the quality management cycle (Plan-Do-Check-Act cycle, PDCA) to continuously improve the effectiveness of the industrial automation cyber security management system.\n5.4 辦理本實驗室與專案場域有關資訊安全教育訓練，提供單位學員資訊安全之意識與強化其對責任之認知。\nConduct cyber security education and training in the Lab and project field, and enhance the awareness of cyber security among department members while reinforcing their understanding of responsibilities.\n5.5 本實驗室及專案場域有關工業自動化資訊安全業務活動的執行須符合法令或法規之要求。\nThe implementation of the industrial automation cyber security operation activities in the Lab and the project field must comply with the requirements of laws and regulations.\n5.6 透過利害相關人及議題等要求事項，達成與資訊安全政策一致之預期。\nAchieving alignment with cyber security policy expectations through stakeholder requirements and issues etc.\n6. 責任Responsibilities \n6.1 管理階層應積極參與及支持資訊安全管理制度，並透過適當的標準和程序以實施本政策。\nManagers shall actively participate in and support the cyber security management system and implement this policy through appropriate standards and procedures.\n6.2 專案人員、委外廠商與專案相關之外部單位及人員均需依照相關安全管理程序以維護資訊安全政策。\nProject personnel, subcontractors, and project-related external units and personnel must follow relevant security management procedures to maintain cyber security policies.\n6.3 所有人員皆有責任報告資訊安全事件和任何已鑑別出之弱點。\nAll personnel are responsible for reporting cyber security incidents and any identified vulnerabilities.\n6.4 任何危及資訊安全之行為，將視情節輕重追究其刑事、民事及行政責任，或依成功大學之相關規定進行懲處。\nAny actions that endangers cyber security shall be investigated for criminal, civil, and administrative responsibilities depending on the severity of the case, or shall be punished according to the relevant regulations of NCKU.\n7. 審查Review\n7.1 本政策應至少每年審查一次，以反映政府法令、技術及業務等最新發展現況，並確保本校永續運作及工控資訊安全實務作業之能力。\nThis policy shall be reviewed at least once a year to reflect the latest developments in government laws, technology, and business, and to ensure the sustainable operation of the school and the capability of industrial automation and control system cyber security practices.\n7.2 當專案團隊或專案發生重大改變時應主動進行審查。\nThis policy shall be actively reviewed when the project team or project undergoes significant changes.\n8. 實施Implementation\n本政策需經專案團隊進行查驗後實施，修正時亦同。\nThis policy and its revisions shall be implemented after being reviewed by the project team.\n9. 參考文件Reference\n9.1 IEC 62243-2-4:2015\n\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n文件編號\nForm No.\nIMI-NCKU-A-001\n機密等級\nLevel of Confidentiality\n一般\nNormal\n版次\nVersion\n1.2\n\n\n\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n文件編號\nForm No.\nIMI-NCKU-A-001\n機密等級\nLevel of Confidentiality\n一般\nNormal\n版次\nVersion\n1.2\n\n\n1\n\n3\n\n",
    "C:\\Users\\user\\Desktop\\VScode\\test\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-001_資訊安全組織程序書 Cyber Security Organization Process_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n資訊安全組織程序書\nCyber Security Organization Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-001         Form No.: IMI-NCKU-B-001\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t1\n4.\t名詞定義Definition of Terms\t1\n5.\t作業說明Operation Instructions\t1\n6.\t參考文件Reference\t11\n\n\n1. 目的Purpose\n為促進國立成功大學資訊與機電整合實驗室（以下稱本實驗室）資訊安全管理制度執行，以有效性之組織架構達成既定之目標，增進業務運作之安全，特制定本程序書。\nTo promote the implementation of the cyber security management system at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\"), and to achieve the established objectives of effectiveness in the organizational structure, and enhance the security of business operations, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and the project field.\n3. 權責Roles and Responsibilities \n3.1 計畫主持人：外部溝通、專案稽核與核可、人員指派。\nProject principal: External communication, project audit and approval, personnel assignment.\n3.2 專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3 行政專員：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4 軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware department: Technology development, patch the program, project schedule planning.\n3.5 測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 作業說明Operation Instructions\n5.1 資訊安全組織架構與工作執掌\nCyber security organizational structure and work management\n5.1.1 資訊安全組織架構如下圖所示，資訊安全組織成員應填寫於「IMI-NCKU-D-001 資訊安全組織成員表」，若遇人員異動應加以更新。 \nThe cyber security organization structure is shown in the figure below. Members of the cyber security organization shall be documented in the \"IMI-NCKU-D-001 Cyber Security Organization Personnel List\" and updated accordingly in the event of personnel changes.\n\n\n圖 1，組織架構圖範例。\n\nFigure 1, Example of the organization structure.\n\n5.1.2 資訊安全管理委員會：由本實驗室計畫主持人指派之國立成功大學資訊與機電整合實驗室資訊安全管理委員會，負責審查資訊安全管理制度相關事項之決議。\nCyber Security Management Committee: The Cyber Security Management Committee of the National Cheng Kung University Information and Mechatronics Integration Lab is appointed by the project principal and is responsible for reviewing resolutions on matters related to cyber security management system.\n(1) 每年定期或視需要召開會議，審查資訊安全管理相關事宜。\nHold meetings on a regular basis or as needed every year to review matters related to cyber security management.\n(2) 視需要召開跨部門之資源協調會議，以協調資訊安全管理制度執行所需之相關資源分配。\nHold cross-departmental resource coordination meetings as necessary to coordinate the allocation of relevant resources required for the implementation of the cyber security management system.\n(3) 確認政策與目標一致性。\nVerify that policies are consistent with objectives.\n(4) 滿足資訊安全相關要求的承諾。\nCommit to meet relevant cyber security requirements.\n(5) 持續改善資訊安全管理系統的承諾。\nCommit to the continuous improvement of the cyber security management system.\n5.1.3 制度管理人或召集人：由本實驗室計畫主持人或由計畫主持人指派專人擔任。\nSystem Manager or Convener Person: Shall be appointed by the project principal of the Lab or designated by the project principal.\n5.1.4 資訊安全官：由資訊安全委員會指派專人擔任。 \nCyber Security Officer: A special person appointed by the Cyber Security Committee.\n(1) 協調資訊安全小組與緊急處理組執行資訊安全相關作業。\nCoordinate the cyber security team and the emergency response team to execute cyber security related operations.\n(2) 對於資訊安全管理之改善提出建議，以及協助執行資訊安全之自我檢核。\nProvide recommendations for the improvement of cyber security management, and assist in the implementation of self-assessment of cyber security.\n(3) 負責對資訊安全狀況進行預警、監控，並對資訊安全狀況與事件進行處置。\nResponsible for early warning and monitoring of cyber security status, and handling cyber security status and events.\n(4) 對於存取控制管理定期進行事件紀錄檢核，以及管理程序檢核。\nRegularly check the event records and management procedures for access control management.\n5.1.5 資訊安全小組：由資訊安全委員會指派人員組成，負責規劃及執行各項資訊安全作業。\nCyber Security Team: Composed of personnel assigned by the Cyber Security Committee, responsible for planning and executing various cyber security operations.\n(1) 資訊安全組織人員異動時，負責更新。\nWhen the personnel of the cyber security organization changes, they are responsible for updating.\n(2) 制定資訊安全管理相關規範。\nFormulate relevant specifications for cyber security management.\n(3) 辦理資訊安全相關教育訓練及活動。\nConduct cyber security-related education, training and activities.\n(4) 建立風險管理制度，執行風險管理。\nEstablish a risk management system and implement risk management.\n(5) 建立安全事件緊急應變暨復原措施。\nEstablish emergency response and recovery measures for security incidents.\n(6) 執行稽核改善建議事項。\nImplement audit improvement recommendations.\n(7) 執行預防措施之改善。\nImplementation of preventive measures for improvement.\n(8) 研討新資訊安全產品或技術。\nDiscuss new cyber security products or technologies.\n(9) 執行資訊安全管理委員會決議事項。\nImplement the resolutions of the Cyber Security Management Committee.\n(10) 鑑別資訊安全相關之法規。\nIdentify laws and regulations related to cyber security.\nA. 資訊安全小組應每年於召開管理審查會議前，針對本實驗室提供之資訊服務來識別資訊安全的相關法令、法規與契約之要求。\nThe Cyber Security Team shall identify the requirements of relevant laws, regulations and contracts for cyber security pertaining to the cyber services provided by the Lab before holding the management review meeting every year.\n5.1.6 緊急處理組：緊急處理組為任務編組，由本實驗室計畫主持人指派人員組成，成員相關權責及作業內容分述如下：\nEmergency Response Team: The Emergency Response Team shall be formed as a task group, comprising personnel assigned by the Lab project principal. The relevant roles and responsibilities of the members and the work content are as follows:\n(1) 緊急處理組組長：\n\tEmergency Response Team Leader:\nA. 當重大資安事件發生時，負責聯絡召集緊急處理組。\nWhen a major cyber security event occurs, the Leader is responsible for contacting assembling the Emergency Response Team.\nB. 協調及督導各關鍵業務流程負責人執行緊急處理作業，並協調資源之調派使用。\nCoordinate and supervise the persons in charge of each key business process to execute emergency handling operations, and coordinate the deployment and use of resources.\nC. 依據事件評估之結果，得報告上級以決議是否宣布災變及啟動業務永續運作計畫。\nAccording to the results of the event evaluation, report to the superior to decide whether to declare a disaster and start the business continuity operation plan.\nD. 當災難發生時，配合救災單位負責搶救人員、物資與設備等及現場指揮工作。\nWhen a disaster occurs, cooperate with the disaster relief unit to be responsible for rescuing personnel, materials and equipment, etc. and on-site command work.\nE. 負責災後協調指揮清理災害現場及復原工作。\nResponsible for post-disaster coordination to clean up disaster sites and conduct restoration work.\n(2) 各關鍵業務流程負責人員：\nPersonnel responsible for each key business process:\nA. 負責對資訊安全狀況進行預警、監控，及對資訊安全事件進行處置\nResponsible for early warning and monitoring of cyber security status and handling of cyber security incidents.。\nB. 負責召集相關人員，發展、維護、更新修訂及執行各災害復原程序。\nResponsible for assembling relevant personnel and for developing, maintaining, updating, revising and implementing various disaster recovery procedures.\nC. 每年負責召集相關人員進行業務永續運作計畫之測試演練。\nResponsible for annually organize testing exercises for business continuity operations involving relevant personnel.\nD. 負責原營運場所或異地備援場所之應變、處理、復原及運轉測試工作。\nResponsible for the response, processing, restoration, and operation test of the original operating site or remote backup site.\nE. 負責災害現場證據收集，俾利未來訴訟與損害求償事宜。\nResponsible for the collection of evidence at the disaster site to facilitate future litigation and damage claims.\nF. 災害現場評估損害狀況及執行原營運場所之現場復原工作。\nAssess the damage of the disaster site and perform on-site restoration of the original operating site.\n5.1.7 資訊安全稽核小組：由本實驗室計畫主持人指派，負責評估資訊安全管理制度之執行情形。\nCyber Security Audit Team: Assigned by the Lab project principal, responsible for assessing the implementation status of the cyber security management system.\n(1) 擬定資訊安全內部稽核計畫。\nDraft the plan for an internal audit of cyber security.\n(2) 執行資訊安全內部稽核。\nExecute the internal audit of cyber security.\n(3) 撰寫資訊安全內部稽核報告。\nWrite internal audit reports on cyber security.\n(4) 追蹤不符合事項之改善執行情形。\nTrack and improve implementation of non-conformities.\n5.2 管理審查會議\nManagement Review Meeting\n5.2.1 資訊安全管理委員會每年應召開一次管理審查會議，必要時得召開臨時會議。\nThe Cyber Security Management Committee shall hold a management review meeting every year, and may hold interim meetings when necessary.\n5.2.2 管理審查會議審查內容建議包含：\nThe content recommendations of management review meeting include:\n(1) 過往管理審查之議案的處理狀態。\nprocessing status of the proposals from previous management reviews.\n(2) 與資訊安全管理制度有關之內部及外部議題的變更。\nChanges in internal and external issues related to the cyber security management system.\n(3) 資訊安全績效之回饋，包括下列之趨勢：\nFeedback on cyber security performance, including the following trends:\nA. 不符合項目及矯正措施。\nNonconforming items and corrective measures.\nB. 監督及量測結果。\nMonitoring and measurement results.\nC. 稽核結果。\nAudit results.\nD. 資訊安全目標之達成。\nAchievement of cyber security objectives.\n(4) 關注方之回饋。\nFeedback from interested parties.\n(5) 風險評鑑結果及風險處理計畫之狀態。\nThe status of risk assessment results and risk handling plans.\n(6) 持續改善之機會。\nOpportunities for continuous improvement.\n(7) 資安治理成熟度評估。\nCyber security governance maturity assessment.\n(8) 資訊安全目標執行狀況報告。\nCyber security target implementation status report.\nA. 以「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」設定之目標為資訊安全目標。\nAccording to the \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\" to set the cyber security goals.\nB. 依「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」所列之範圍及目標擬制定CSMS有效性量測表，並以該表之量測結果做為本項審查項目之主要討論內容。\nFormulate a CSMS effectiveness measurement form according to the scope and objectives listed in \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\" and use the measurement results as a basis to discuss each review item.\nC. 資訊安全執行小組擬藉由CSMS有效性量測表之量測項目與目標水準建立CSMS績效指標，蒐集各項量測項目之相關資料，據以評估本實驗室資訊安全目標之達成情形。\nThe Cyber Security Execution Team intends to establish CSMS performance indicators based on the measurement items and target levels of the CSMS effectiveness measurement form, and collect relevant data on each measurement item to evaluate the Lab's achievement of cyber security goals.\n5.2.3 管理審查會議之決議事項建議包含：\nSuggestions for resolutions at the management review meeting include:\n(1) 與持續改善機會有關之決策。\nDecisions related to continual improvement opportunities.\n(2) 任何對資訊安全管理系統變更之需要。\nAny need for changes to the cyber security management system.\n(3) 資訊安全制度執行之各項改進措施。\nVarious improvement measures for the implementation of the cyber security system.\n(4) 更新風險評鑑與風險處理計畫。\nUpdated risk assessment and risk management plans.\n(5) 針對可能影響資訊安全制度之內外部事件，修正資訊安全管理流程與控制措施。內外部事件包括：\nRevisions to the cyber security management process and control measures in response to internal and external events that may affect the cyber security system. Internal and external events include:\nA. 營運需求的變更。\nChanges in operational requirements.\nB. 安全需求的變更。\nChanges in security requirements.\nC. 影響現行營運需求的業務程序變更。\nChanges to business processes that affect current operational requirements.\nD. 管理或法規需求的變更。\nChanges in management or regulatory requirements.\nE. 契約要求的變更。\nChanges to contractual requirements.\nF. 可接受風險等級或標準的變更。\nChanges to acceptable risk levels or criteria.\n(6) 針對資訊安全制度之需要，協調所需之資源。\nCoordinate the required resources based on the needs of the cyber security system.\n(7) 控制措施及有效性評量方式的改善。\nImprovement of control measures and effectiveness evaluation methods:\nA. 評量時應決定執行事項、所需資源、負責人員、完成時間、成果評估方式等項目，以確認資訊安全目標之達成。\nDuring the evaluation, items such as implementation items, required resources, responsible personnel, completion time, and result evaluation methods shall be determined to confirm the achievement of cyber security objectives.\nB. 本實驗室應每年檢視「IMI-NCKU-D-003 資安管理指標暨有效性量測表」之量測執行狀況。\nThe Lab shall inspect the measurement execution status of \" IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form\" every year.\nC. 若「IMI-NCKU-D-003 資安管理指標暨有效性量測表」之量測項目與目標水準有進行調整之需要，可進行討論與改善決議。\nIf there is a need to adjust the measurement items and target levels of \"IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form,\" discuss and improve the resolution.\n5.3 組織間的合作及協調\nCooperation and Coordination among Organizations\n5.3.1 為確保資訊安全事件發生時，儘速執行事件處理，須與權責或外部單位隨時保持聯繫，例如：主管機關、資通安全會報、消防單位等；並建立與組織資訊安全管理制度相關之「IMI-NCKU-D-002 外部單位聯絡清單」。\nIn order to ensure that when a cyber security incident occurs, the incident is handled as soon as possible, it is necessary to remain in contact with authorities and external units at all times, including the competent authority, the cyber security report, the fire department, etc.; and establish and organize an \"IMI-NCKU-D-002 External Contact List\" related to the cyber security management system.\n5.3.2 「IMI-NCKU-D-002 外部單位聯絡清單」每年至少一次由專案經理負責維護，視組織或合約變動適時更新。\nThe \"IMI-NCKU-D-002 External Contact List\" shall be updated by the project manager at least once a year, and revised in due course depending on changes in the organization or contract.\n5.3.3 應隨時與資訊安全技術相關團體維持聯繫，獲取資訊安全技術及產品資訊與知識，以及處理資訊安全事件或執行系統修補資訊等，並將資訊建立於「IMI-NCKU-D-002 外部單位聯絡清單」，由資訊安全小組負責維護更新。\nKeep in touch with groups related to cyber security technology at all times to obtain information and knowledge on cyber security technology and products, as well as to deal with cyber security incidents and implement the information of system patch. The information shall be documented in \"IMI-NCKU-D-002 External Contact List,\" which maintained and updated by the Cyber Security Team.\n5.3.4 參考「IMI-NCKU-B-011 事件管理程序書」與相關權責單位建立通報管道並執行通報作業，聯繫方式應詳列於「IMI-NCKU-D-002 外部單位聯絡清單」。\nRefer to \"IMI-NCKU-B-011 Incident Management Process\" to establish notification channels with relevant responsible units and execute notification operations. The contact information shall be listed in the \"IMI-NCKU-D-002 External Contact List.\"\n5.4 資訊安全目標的達成計畫與量測方式\nCyber Security Target Achievement Plan and Measurement Method\n5.4.1 資訊安全目標應與資訊安全政策一致並可量測，同時應考量適用之資訊安全要求，以及風險評鑑及處理之結果。並將資訊安全目標與相關事項傳達給本實驗室人員、委外廠商與資安作業相關單位，且於定期或組之重大變更時進行更新。\nCyber security objectives shall be consistent with the cyber security policy and must be measurable. At the same time, the applicable cyber security requirements and the results of risk assessment and treatment shall be taken into consideration. Cyber security goals and related matters shall be communicated to the Lab's personnel, outsourced vendors, and cyber security operation related units, and the goals shall be updated regularly or when there are major changes in the organization.\n5.4.2 應定期規劃達成資訊安全目標作業，應包含：\nThe operation to achieve cyber security objectives shall be regularly planned and shall include:\n(1) 相關執行活動或事項。\nRelevant implementation activities or items.\n(2) 所需投入之人員、預算、設備技術與程序表單等資源。\nRequired resources such as personnel, budget, equipment technology, and procedure lists.\n(3) 活動或事項負責人員。\nPersonnel responsible for the activities or items.\n(4) 活動或事項預計完成時間。\nEstimated completion time of activities or items.\n(5) 管理目標是否達成之評估方式。\nEvaluation method of whether management objectives were achieved\n5.4.3 完成上述資訊安全目標達成作業規劃並詳列於「IMI-NCKU-D-003 資安管理指標暨有效性量測表」，由資訊安全小組負責維護更新。\nThe operation plan for achieving the aforementioned cyber security objectives shall be developed and documented in \"IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form,\" which shall be maintained and updated by the Cyber Security Team.\n5.5 專案管理的資訊安全\nCyber Security for Project Management\n5.5.1 無論任何型態的專案，於需求說明書或契約書中，應對資訊安全加以陳述。\nIn any type of project, cyber security shall be addressed in the requirements specification or contract document.\n5.5.2 專案啟始時應執行風險評鑑，以評估專案實施階段可能發生的資訊安全風險。\nRisk assessment shall be carried out at the beginning of the project to assess the cyber security risks that may occur during the project implementation stage.\n5.5.3 資訊安全專案管理之運作應依據專案管理五階段：啟始(Initiating)、規劃(Planning)、執行(Executing)、監控(Monitoring)和結束(Closing)，將資訊安全管理制度規範納入該專案的每一個階段進行控管。\nOperation of cyber security project management shall be based on five phases of project management: Initiating, Planning, Executing, Monitoring, and Closing, and cyber security management system rules shall be included in the project controls at every stage of the Project.\n5.5.4 專案管理應對專案相關人員進行角色界定與責任配置。\nProject management shall define the roles and assign responsibilities of project-related personnel.\n5.6 行動裝置及遠距工作\nMobile Devices and Remote Working\n5.6.1 私人之行動裝置連結本實驗室無線網路，應有正常登錄程序。\nThere shall be a normal login procedure for personal mobile devices to connect to the Lab's wireless network.\n5.6.2 公務之行動裝置不得破解或越獄，程式應於合法官方管道下載。\nSchool-issued mobile devices must not be cracked or jailbroken, and programs shall be downloaded from legitimate official channels.\n5.6.3 勿於公務之行動裝置隨意點選社群網站或即時通訊軟體中之超連結。\nDo not randomly click on hyperlinks in social networking sites or instant messaging software when using official mobile devices.\n5.6.4 未經單位網路管理人員授權許可，禁止執行網路偵測、弱點掃描、封包收集分析等工具軟體。\nWithout the authorization of the department's network management personnel, it is prohibited to execute tools and software such as network detection, vulnerability scanning, and packet collection and analysis.\n5.6.5 可攜式電腦建議安裝防毒軟體，並定期檢查作業系統修正程式與更新病毒碼為最新版本。\nIt is recommended to install antivirus software on portable computers, and regularly check the operating system's repair program and update the virus definitions to the latest version.\n5.6.6 個人專屬行動裝置使用時應謹防資訊外洩或是中毒。\nBeware of information leakage and viruses when using personal mobile devices.\n5.6.7 為確保本實驗室遠距工作之安全，應訂定作業管理規範，以降低遠距工作風險，相關程序與方法請參閱「IMI-NCKU-B-010 遠端存取安全管理程序書」。\nIn order to ensure the security of remote work in the Lab, operation management regulations shall be formulated to reduce the risk of remote work. For related procedures and methods, please refer to \"IMI-NCKU-B-010 Remote Access Security Management Process.\"\n6. 參考文件Reference\n6.1 IMI-NCKU-D-001 資訊安全組織成員表\nIMI-NCKU-D-001 Cyber Security Organization Personnel List\n6.2 IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.3 IMI-NCKU-D-002 外部單位聯絡清單\nIMI-NCKU-D-002 External Contact List\n6.4 IMI-NCKU-D-003 資安管理指標暨有效性量測表\nIMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form\n6.5 IMI-NCKU-B-011 事件管理程序書\nIMI-NCKU-B-011 Incident Management Process\n6.6 IMI-NCKU-B-010 遠端存取安全管理程序書。\nIMI-NCKU-B-010 Remote Access Security Management Process\n\n\n資訊安全組織程序書\nCyber Security Organization Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n資訊安全組織程序書\nCyber Security Organization Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n9\n\n",
    "C:\\Users\\user\\Desktop\\VScode\\test\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-002_場域人員管理程序書 Field Personnel Management Process_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n場域人員管理程序書\nField Personnel Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-002         Form No.: IMI-NCKU-B-002\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t4\n2.\t適用範圍Scope of Application\t4\n3.\t權責Roles and Responsibilities\t4\n4.\t名詞定義Definition of Terms\t4\n5.\t作業說明Operation Instructions\t5\n6.\t參考文件Reference\t12\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）資訊安全管理制度執行之範圍，達成資安管理制度之目標，並為有效管理本實驗室專案場域之專案中參與人員，在專案執行期間，具備能力與專業知識，遵守專案場域管理與資訊安全要求，熟悉資訊安全程序，避免資訊安全問題，維持專案場域正常運作，特制定本程序。\nTo ensure the scope of the cyber security management system at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and achieve the goals of the security management system, and to effectively manage the participants in the project field of the Lab's project, it is necessary for the participants to possess the required capabilities and professional knowledge, comply with the project field management and cyber security requirements, be familiar with cyber security procedures, avoid cyber security issues, and maintain the normal operation of the project field, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and project field.\n3. 權責Roles and Responsibilities\n3.1  計畫主持人：外部溝通、專案稽核與核可、人員指派。\nProject principal: External communication, project audit and approval, personnel assignment.\n3.2  專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3  行政專員：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4  軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware department: Technology development, patch the program, project schedule planning.\n3.5  測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n4.1  專案人員：本實驗室內部人員與委外廠商。 \nProject personnel: Internal the Lab personnel and outsourced vendors.\n4.2  委外廠商：支援本專案之委外廠商，包含委外廠商之分包商、顧問或代表等。 \nOutsourced vendors: Outsourced vendors who support this project, including subcontractors, consultants, and representatives.\n5. 作業說明Operation Instructions\n5.1  為了解專案場域之範圍與內容，可參考架構如下圖1： \nIn order to understand the scope and content of the project field, please refer to Figure 1 below for the structure:\n\n圖1、場域架構圖範例。\nFigure 1, Example of field architecture diagram.\n\n5.2  本專案之專案人員組織圖參考如下圖2： \nFor the organization chart of project personnel, please refer to Figure 2 below:\n\n圖2、本實驗室專案人員組織圖範例。\n\n\nFigure 2, Example organization chart of the Lab's project personnel.\n\n5.3  本實驗室與專案場域資訊安全政策與承諾\nCyber security policy and commitment of the Lab and project field\n任何指派到專案場域之專案人員應詳知本專案資訊安全政策與承諾與遵守資產擁有者相關要求之職責、政策和程序以及IEC 62443-2-4規範，其中人員包括本專案執行人員、委外廠商、分包商與顧問或代表人員，詳如「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」所示。\nAll personnel assigned to the project field shall be fully aware of the project's cyber security policies, commitments, and the responsibilities, policies, and procedures pertaining to the asset owner as well as the requirements specified in IEC 62443-2-4 standard. The personnel mentioned include project implementers, outsourced vendors, subcontractors, consultants, and representatives, as detailed in \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\".\n5.4  專案人員職務資格要求與職責\nQualification Requirements and Responsibilities of Project Personnel\n所有參與本專案與專案場域之相關專案執行人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，應先經過實驗室安全背景調查(如：人員資料、良民證等)，除具備賦予權責的專業技能與知識外，並需通過IEC 62443教育訓練，其職務資格與職責詳如下表：\nAll personnel involved in this project and the project field, including project executives, outsourced vendors, subcontractors, and consultants or representatives, shall undergo the Lab's security background check (e.g., personnel information, Police Criminal Record Certificate, etc.). In addition to possessing the necessary professional skills and knowledge, they shall also pass IEC 62443 education and training. Job qualifications and responsibilities are detailed in the table below:\n\n表 1、職務資格與權責。\nTable 1, Job qualifications and responsibilities.\nPosition\nQualification\nResponsibilities\n計畫主持人\nProject Principal\n理工博士、年資二十年以上。\nDoctor of science and engineering, more than 20 years of experience.\n外部溝通、挑選合格的人員擔任安全主管，確保自動化系統的安全性，並執行專案稽核與核可。\nExternal communication, selection of qualified personnel as security supervisors, ensuring the security of automated systems, and conducting project audits and approvals.\n專案經理\nProject Manager\n製造資訊背景之碩士、年資超過一年以上、熟悉軟體開發程式語言、具備專案管理能力。\nMaster's degree in Manufacturing Information, more than 1 year of experience, familiarity with software development programming languages, and project management capabilities.\n監督、內外部溝通、時程規劃、風險評估、帳號管理。\nSupervision, internal and external communication, schedule planning, risk assessment, account management.\n行政專員\nAdministrative Commissioner\n學士畢業、精通文書管理程式、具備會計相關知識、熟悉學校作業。\nBachelor's degree, proficient in document management procedures, accounting-related knowledge, familiar with university operations\n內外部溝通、執行行政事務、人事管理事務、教育訓練召集，內部稽核。\nInternal and external communication, executive administrative affairs, personnel management affairs, convening education and training, internal audit.\n軟體工程師\nSoftware Engineer\n製造資訊背景之碩士、熟悉軟體開發程式語言、了解嵌入式設備、知悉工控通訊協定。\nMaster's degree in Manufacturing Information, familiar with software development programming language, understands embedded devices, understands industrial control communication protocols\n技術開發、程式修補、專案進度規劃。\nTechnology development, program repair, project schedule planning.\n測試工程師\nTest Engineer\n製造資訊背景之碩士、熟悉軟體開發程式語言、會使用測試軟體。\nMaster's degree in Manufacturing Information, familiar with software development programming language, able to use testing software\n專案進度規劃、軟體測試、報告測試結果。\nProject schedule planning, software testing, and reporting of test results.\n\n5.5  人員指派辦法\nPersonnel assignment method\n5.5.1 本專案人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，派遣至專案場域前，需了解資產擁有者之政策、程序等要求，並使用「IMI-NCKU-D-007 專案人員評鑑表」評核後合格者，經計畫主持人同意後，由行政專員以書面形式通知資產擁有者，待資產擁有者核准後，始能進入資產擁有者專案場域執行該專案。\nThe project personnel, including project executives, outsourced vendors, subcontractors, consultants, and representatives need to understand the asset owner's policies, procedures, and other requirements before being dispatched to the project field, and use the \"IMI-NCKU-D-007 Project Personnel Evaluation Form.\" After the evaluation, if the project principal approves, the administrative commissioner shall notify the asset owner in writing. After the asset owner approves, the personnel can enter the asset owner's project field for execution the project.\n5.5.2 派遣至本專案人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，應遵守資產擁有者於場域的各項資訊安全要求的政策和程序，如：變更管理、工作許可等，並提供背景資料與犯罪紀錄調查（如，良民證），經行政專員確認符合本專案人員條件後，簽署「IMI-NCKU-D-005 委外廠商與人員保密切結書」作為依據。\nAll personnel assigned to the project, including executing personnel, outsourced vendors, subcontractors, consultants, and representatives, shall comply with the policies and procedures of the asset owner's various cyber security requirements in the field, such as management of changes (MoC), permit to work (PtW), etc., and shall provide background information and criminal record investigation (such as Police Criminal Record Certificate). After the administrative commissioner confirms that the person meets the requirements for project personnel, they must sign the \"IMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\" as the basis.\n5.6  人員教育訓練\nPersonnel education and training\n為促使本專案執行人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，迅速了解專案場域業務狀況進而提高工作效能，由計畫主持人授權行政專員，向專案人員說明本專案之運作，並需配合資產擁有者政策、程序、作業標準以及資料保密等要求，進行相關訓練，促使人員於最短時間內能適應並勝任。\nIn order to promote the implementation of the project and help executing personnel, outsourced vendors, subcontractors, consultants, and representatives to quickly understand the business status of the project field and improve work efficiency, the project principal authorizes the administrative commissioner to explain project operations to the project personnel, and shall cooperate with the asset owner's policies, procedures, operating standards, and data confidentiality requirements, to conduct relevant training to enable personnel to swiftly adapt and gain competence.\n5.6.1 本專案人員應瞭解本專案任何變更，應依據「IMI-NCKU-B-003 變更管理程序書」進行變更申請，由資產擁有者同意後，使得進行變更。\nThe project personnel shall be aware of any changes in the project, and shall apply for changes in accordance with the \"IMI-NCKU-B-003 Change Management Process\", and make changes after the asset owner agrees.\n5.6.2 行政專員負責：每年招開工控資安教育訓練課程，可以上課、會議、實作等方式自行辦理訓練，並於「IMI-NCKU-D-004 人員資料表」中登錄。\nThe administrative commissioner is responsible for conducting industrial automation and control system cyber security education and training courses every year, in the form of classes, meetings, implementation, etc., and shall document it in the \"IMI-NCKU-D-004 Personnel Data Sheet\".\n5.6.3 視需要派人參加外部資安相關訓練，由受訓人員辦理報名手續準時出席。\nIf necessary, personnel shall be sent to participate in external cyber security related training, and the trainees shall go through the registration procedures and attend on time.\n5.6.4 專案場域自訓之訓練教材以相關品質文件、作業標準為主，講師由專案場域資深人員或曾接受過相關訓練之人員擔任。\nThe training materials for project field self-training are mainly based on relevant quality documents and operating standards, and the lecturers are senior personnel in the project field or personnel who have received relevant training.\n5.6.5 外部受訓所取得之證書，正本自存，影印本與「IMI-NCKU-D-004 人員資料表」一併存查。\nThe original of the certificates obtained from external training shall be kept on file by self, and the photocopies shall along with the \"IMI-NCKU-D-004 Personnel Data Sheet\" for reference.\n5.6.6 為管理訓練執行情形，應將上述各類訓練資料於訓練結束後於由行政專員記錄於「IMI-NCKU-D-004 人員資料表」中。\nIn order to manage the implementation of the training, the aforementioned training data shall be recorded in the \"IMI-NCKU-D-004 Personnel Data Sheet\" by the administrative commissioner after the training is over.\n5.7  人員能力資格管理考核\nPersonnel capability qualification management assessment\n5.7.1 人員派遣前應通過相關技術與工控資訊安全能力考核，使用「IMI-NCKU-D-007 專案人員評鑑表」進行考核，考核資料應與「IMI-NCKU-D-004 人員資料表」一併存查。\nPersonnel shall pass the relevant technology and industrial automation and control system cyber security capability assessment before dispatch, and use the \"IMI-NCKU-D-007 Project Personnel Evaluation Form\" for assessment. The assessment data shall be consistent with the \"IMI-NCKU-D-004 Personnel Data Sheet\" and both forms shall be kept together for inspection.\n5.7.2 每年應針對工控資訊安全至少進行一次內部或外部教育訓練，每2年應進行至少一次能力考核。\nAt least one internal or external education and training for industrial automation and control system cyber security shall be conducted every year, and at least one ability assessment shall be conducted every 2 years.\n5.8  委外廠商人員資格審查程序\nQualification review procedures for outsourced vendors\n5.8.1 專案場域因技術需求，需引用委外廠商，應經過資產擁有者同意始能派遣，詳見「IMI-NCKU-B-004 委外廠商管理程序書」。\nDue to the technical requirements of the project field, the outsourced vendors need to be cited, and the dispatch shall be approved by the asset owner. For details, see \"IMI-NCKU-B-004 Outsourced Vendors Management Process\".\n5.9  人員變更管理\nPersonnel Change Management\n5.9.1 本專案團隊因人員或技術等因素產生異動，應依據「IMI-NCKU-B-003 變更管理程序書」進行變更申請，若為人員離開本專案，需由行政專員以E-mail正式通知資產擁有者，且於該人員之「IMI-NCKU-D-004 人員資料表」中述明離開專案日期。\nWhen the project team changes due to factors such as personnel or technology, the team shall apply for changes in accordance with \"IMI-NCKU-B-003 Change Management Process\". If a person leaves the project, the administrative commissioner must formally notify the asset owner via e-mail, and state the date of leaving the project in the \"IMI-NCKU-D-004 Personnel Data Sheet\" of the personnel.\n5.9.2 本專案團隊異動經完成變更程序後，行政專員應以書面形式記錄於「IMI-NCKU-D-006 人員異動交接清單」，並重新派遣具該職位能力且獲得資格之人員，由資產擁有者同意後，始能進入專案場域執行該專案。\nAfter processing of the changes to the project team has been completed, the administrative commissioner shall record it in the \"IMI-NCKU-D-006 The Change of Personnel List\" in written form, and dispatch new qualified personnel with the ability for the position; the new personnel may access the project field to execute the project after the asset owner approves.\n5.10  溝通管理\nCommunication management\n5.10.1 本實驗室應與資產擁有者確認提供之自動化解決方案是否符合IEC 62443-2-4要求。\nThe Lab shall confirm with the asset owner whether the provided automation solution complies with the requirements of IEC 62443-2-4.\n5.10.2 本實驗室應將自動化解決方案中IACS的安全觀點傳達予資產擁有者及相關人員。\nThe Lab shall communicate the security perspective of IACS in automation solutions to asset owners and related personnel.\n5.10.3 本實驗室應確保所提供的服務符合資產擁有者的相關規定，例如：IEC 62443-2-4要求與本實驗室內部IACS的安全要求。\nThe Lab shall ensure that its services provided comply with the relevant regulations of the asset owner, such as the requirements of IEC 62443-2-4 and the Lab's internal IACS security requirements.\n5.10.4 本實驗室應與資產擁有者確認合約內的條文，避免對於合約內容產生誤解，對於委外廠商也需確認是否符合相關要求。\nThe Lab shall confirm the terms of the contract with the asset owner to avoid misunderstandings about the content of the contract. For outsourced vendors, it is also necessary to confirm whether they meet the relevant requirements.\n5.10.5 若有需追蹤事項，需經由人員管理會議或線上會議決定，指派專人建立窗口，負責執行與追蹤，並回報予專案經理直至追蹤事項結束。\nIf there is an item that needs to be tracked, it needs to be decided through a personnel management meeting or an online meeting, and a dedicated person shall be assigned to serve as the contact window, take responsibility for implementation and tracking, and report to the project manager until the end of the tracked item.\n6. 參考文件Reference\n6.1  IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.2  IMI-NCKU-D-007 專案人員評鑑表\nIMI-NCKU-D-007 Project Personnel Evaluation Form\n6.3  IMI-NCKU-D-005 委外廠商與人員保密切結書\nIMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\n6.4  IMI-NCKU-B-003 變更管理程序書\nIMI-NCKU-B-003 Change Management Process\n6.5  IMI-NCKU-D-004 人員資料表\nIMI-NCKU-D-004 Personnel Data Sheet\n6.6  IMI-NCKU-B-004 委外廠商管理程序書\nIMI-NCKU-B-004 Outsourced Vendors Management Process\n6.7  IMI-NCKU-D-006 人員異動交接清單\nIMI-NCKU-D-006 The Change of Personnel List\nField Personnel Management Procedures\nFile No.\nIMI-NCKU-B-002\nConfidentiality Level\nConfidential\nVersion\n1.2\n\n\n8\n\n\n\n\n\n場域人員管理程序書\nField Personnel Management Process\n文件編號\nForm No.\nIMI-NCKU-B-002\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n\n\n場域人員管理程序書\nField Personnel Management Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\nField Personnel Management Procedures\nFile No.\nIMI-NCKU-B-002\nConfidentiality Level\nConfidential\nVersion\n1.2\n\n\n",
    "C:\\Users\\user\\Desktop\\VScode\\test\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-004_委外廠商管理程序書 Outsourced Vendors Management Process_0705修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-004         Form No.: IMI-NCKU-B-004\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t1\n4.\t名詞定義Definition of Terms\t3\n5.\t作業說明Operation Instructions\t3\n6.\t參考文件Reference\t10\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）與專案場域之委外廠商，於委外執行前或委外契約履行時，其提供之交付標的與服務作業均能符合工業自動化與控制系統資訊安全管理規範，特制定本程序書。\nTo ensure that the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and the outsourced vendors for project fields comply with the industrial automation and control system cyber security management specifications for the verification of deliverables and service operations provided prior to or during the execution of outsourcing contracts, this process is hereby established.\n2. 適用範圍Scope of Application\n2.1 適用於本實驗室與專案場域之相關委外服務項目，包括：\nOutsourced Services of the Lab and the project field, including:\n2.1.1 工業自動化設備。\nIndustrial automation equipment.\n2.1.2 主機系統委外採購與維護。\nOutsourced procurement and maintenance of the host system.\n2.1.3 網路相關硬體設備委外採購與維護。\nOutsourced procurement and maintenance of network-related hardware equipment.\n2.1.4 應用系統套裝軟體客製化及維護\nCustomization and maintenance of application system package software.\n2.1.5 專業顧問服務委外\nOutsourced professional consulting services.\n3. 權責Roles and Responsibilities\n3.1 專案團隊︰負責依據本程序書之規定，提出適當之安全需求及擬定與廠商服務相關合約內容，並確實在合約中訂定保密條款。\nProject team: Responsible for proposing appropriate security requirements and formulating the content of contracts related to vendors services, in accordance with the provisions of this process document, and ensuring the inclusion of confidentiality clauses in the contracts.\n3.2 業務權責單位Business Authority and Responsible Unit:\n3.2.1 負責審查專案團隊所擬定之合約，確認合約內容無違反本實驗室應遵循之相關規定或傷害本實驗室之權益。\nResponsible for reviewing the contract drawn up by the project team, confirming that the content of the contract does not violate the relevant regulations of the Lab that shall be followed or damage the rights and interests of the Lab.\n3.2.2 對於提供委外服務之廠商遴選，應符合專案團隊所提出之安全需求及採購辦法之規範。\nThe selection of the vendors that provide outsourced service shall comply with the security requirements and procurement methods proposed by the project team.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 作業說明Operation Instructions\n5.1 一般條款\nGeneral terms\n5.1.1 委外廠商及其服務人員，均應遵守專案場域之「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」、法規與作業程序。\nThe outsourcing vendors and their service personnel shall comply with the \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy,\" regulations, and operating procedures of the project field.\n5.1.2 委外廠商應負責系統維護、聯絡窗口及電話詢答服務，並解決系統相關事宜，並配合本實驗室相關程序辦理異常排除及通報事宜，如必要時應提供駐點服務。\nThe outsourcing vendors shall be responsible for system maintenance, contact windows and telephone inquiry service, and solve system-related matters, and cooperate with the relevant procedures of the Lab to handle abnormalities and notification matters, and provide on-site services if necessary.\n5.1.3 委外廠商應遵守本實驗室之相關規定，並簽訂「IMI-NCKU-D-005 委外廠商與人員保密切結書」。\nThe outsourcing vendors shall comply with the relevant regulations of the Lab, and sign the \"IMI-NCKU-D-011 Confidentiality Agreement for External Suppliers and Personnel\".\n5.1.4 委外廠商履行合約提供使用之軟體，均需為合法軟體，並不得違反智慧財產權之規定，如有違反事情發生，委外廠商須承擔所有法律責任。\nThe software provided by the outsourcing vendors to perform the contract must be legal software and must not violate the provisions of intellectual property rights. If any violation occurs, the outsourcing vendors must assume all legal liability.\n5.1.5 委外廠商使用之工具軟體及處理作業之執行紀錄，本實驗室有權進行稽核，廠商不得異議。\nThe Lab has the right to audit the execution records of the tool software and processing operations used by outsourcing vendors, and the vendors shall not object.\n5.1.6 委外廠商應留存異常處理紀錄，本實驗室得視需要查核。\nThe outsourcing vendors shall keep abnormal handling records, which may be checked by the Lab as needed.\n5.1.7 委外廠商所交付之標的物如侵害第三人合法權益時，應由承包廠商負責處理並承擔一切法律責任。\nThe contracting party shall be responsible for handling and assuming all legal liabilities when the deliverables provided by the outsourcing vendors infringe upon the legitimate rights and interests of third parties.\n5.1.8 委外廠商如因其員工執行業務之過失，造成本實驗室損失或傷害，委外廠商需負損害賠償責任。\nIf the outsourcing vendors' employees causes loss or injury to the Lab due to the negligence in the course of business, the outsourcing vendors shall be liable for damages.\n5.1.9 委外廠商相關系統之開發或負責人員離職時，應繳回其所借用之設備、軟體及作業權限。\nThe equipment, software, and operating license loaned to the outsourcing vendors shall be returned when the developer or other responsible personnel of the relevant system of the outsourcing vendors leave the job.\n5.1.10 委外廠商人員於支援業務時所獲知敏感等級以上資訊，不得對外透露。\nPersonnel from outsourced vendors, while providing support services, shall not disclose sensitive information classified at or above the designated sensitivity level to external parties.\n5.1.11 委外廠商如知悉或觀察到本實驗室系統之任何可疑的資訊安全弱點應立即通報本實驗室，並保留相關證據。\nIf the outsourcing vendors knows or observes any suspicious cyber security weaknesses of the Lab system, they shall immediately report to the Lab and retain relevant evidence.\n5.2 委外廠商要求與評估作業\nRequirements and assessment for outsourcing vendors\n5.2.1 業務委外之需求，應參考專案場域需求規格，並請委外廠商提供適當之服務建議書。\nThe requirements for business outsourcing shall be based on the project field requirements specification, and the outsourcing vendor shall be requested to provide a suitable service proposal.\n5.2.2 軟體委外採購時，得將「IMI-NCKU-D-009 廠商軟體評估表」列為建議書徵求說明文件之附件，以評估廠商所提供軟體之安全性。\nWhen software is outsourced, the \"IMI-NCKU-D-009 Vendor Software Evaluation Form\" may be listed as an attachment to the proposal request document to evaluate the security of the software provided by the vendor.\n5.2.3 硬體委外採購時，得將「IMI-NCKU-D-010 廠商硬體評估表」列為建議書徵求說明文件之附件，以評估廠商所提供硬體之安全性。\nWhen hardware is outsourced, the \"IMI-NCKU-D-010 Vendor Hardware Evaluation Form\" may be listed as an attachment to the proposal request document to evaluate the safety of the hardware provided by the vendor.\n5.2.4 委外廠商訂定資訊安全需求：\nThe cyber security requirements of the outsourcing vendor:\n(1) 委外廠商應提供參與本案相關人員之學歷、工作資格及在職證明文件。\nThe outsourcing vendor shall provide the academic qualifications, work qualifications, and on-the-job certification documents of the relevant personnel involved the project.\n(2) 委外廠商需保證與委外作業有關的各方（包括分包商）都應遵守資訊安全法令規定。\nThe outsourcing vendors need to ensure that all parties (including subcontractors) related to outsourced operations shall comply with cyber security laws and regulations.\n(3) 委外廠商於本專案發生重大資訊安全威脅時，應配合提供維護服務。\nThe outsourcing vendor shall provide maintenance services when a major cyber security threat occurs in the project.\n(4) 對於專案中資訊安全之需求，本實驗室保有查核之權利。\nThe Lab reserves the right to review the cyber security requirements in the project.\n(5) 本實驗室為落實委外之管理監督，得定期對委外廠商進行查核作業。\nIn order to implement the management and supervision of outsourcing, the Lab may regularly review the outsourcing vendors.\n5.3 資訊系統委外服務提出\nRequest for outsourcing of information system services\n5.3.1 專案團隊因業務需求提出資訊委外服務，應適當評估資訊委外之必要性。\nThe project team shall assess the necessity of outsourcing information services based on business requirements.\n5.3.2 若為主機系統之委外採購，專案團隊應對系統需求做適當規劃，以確保足夠的電腦處理及儲存容量。\nFor the outsourced procurement of the mainframe system, the project team shall make proper planning for the system requirements to ensure sufficient computer processing and storage capacity.\n5.4 資產識別與風險評鑑作業\nAsset identification and risk assessment operations\n5.4.1 專案團隊應依據「IMI-NCKU-B-006 威脅與風險評鑑程序書」，依照委外標的之資訊資產價值、可用性、機密性、完整性等級，適當評估其可能之威脅及弱點。\nThe project team shall evaluate the potential threats and vulnerabilities based on the value, availability, confidentiality, and integrity levels of the outsourced information assets, in accordance with the \"IMI-NCKU-B-006 Threat and Risk Assessment Management Process\".\n5.5 選擇或新增安全需求Select or add security requirements\n5.5.1 專案團隊依據上述風險評鑑結果，進行風險管理作業，選擇適用之安全需求項目，明訂於合約之中。\nThe project team performs risk management operations based on the above risk assessment results, selects applicable security requirements items, and clearly records them in the contract.\n5.6 硬體採購與維護Hardware procurement and maintenance\n5.6.1 廠商應提供與設備主機之架構、操作、管理、維護等相關之操作手冊、文件與技術支援，如必要亦應提供教育訓練課程。\nThe vendor shall provide operation manuals, documents and technical support related to the structure, operation, management and maintenance of the equipment host, and shall also provide education and training courses if necessary.\n5.7 系統帳號管理System account management\n5.7.1 委外系統資料、軟體或作業系統最高權限帳號、資料庫最高權限帳號，應由本實驗室計畫主持人或專案經理保管，不得直接授與委外廠商使用。\nThe outsourced system data, software or operating system account with the highest authority, and the database account with the highest authority shall be kept by the project principal or project manager of the Lab, and shall not be directly granted to the outsourcing vendors for use.\n5.7.2 委外廠商之人員如因作業需求，需對本實驗室系統進行存取，應遵循相關安全管理規範，並由本實驗室人員填寫「IMI-NCKU-D-011 場域服務變更申請表」代為提出申請。\nIf the personnel of the outsourcing vendor need to access the Lab system due to operational requirements, they shall follow the relevant security management regulations, and submit an \"IMI-NCKU-D-011 Change of Field Service Application Form\" on behalf of the Lab personnel.\n5.7.3 「IMI-NCKU-D-011 場域服務變更申請表」中應載明作業需求內容、所需權限、帳號有效時間，經由計畫主持人核准後，由專案經理依照所需權限及帳號有效時間，建立獨立之帳號供委外廠商人員使用。\nThe \"IMI-NCKU-D-011 Change of Field Service Application Form\" shall specify the content of the operation requirements, the required authority, and the valid time of the account. After approval by the project principal, the project manager shall create a separate account for the outsourcing vendor personnel according to the required authority and account validity time.\n5.7.4 委外廠商人員對於系統帳號應善盡保管之責，系統帳號不得任意交由非作業相關人員使用。\nOutsourced personnel shall be responsible for properly safeguarding system accounts, and system accounts shall not be used by individuals unrelated to the operations.\n5.7.5 委外廠商人員對於系統之操作，本實驗室各系統管理者應盡監督之責，委外廠商人員不得從事非工作範圍內之操作。各系統管理者並應於委外廠商人員完成工作後檢視系統紀錄。\nThe system managers of the Lab shall be responsible for supervising the operation of the system by the personnel of the outsourcing vendors, and the personnel of the outsourcing vendors shall not engage in operations that are not within the scope of work. Each system manager shall also check the system records after the outsourced personnel complete the work.\n5.8 緊急應變計畫Emergency response plan\n5.8.1 資訊作業若涉及本實驗室之專案業務時，得要求委外廠商配合本實驗室定期進行業務永續運作計畫，針對委外標的建立緊急應變計畫，並定期進行測試；若該委外案件屬於整體委外者，應以委外系統及資料兩者中最高資訊資產價值衡量演練週期。\nWhen it comes to projects involving the operations of the Lab, the outsourcing vendors may be required to cooperate with the Lab in developing a business continuity plan for sustainable operations. They shall establish an emergency response plan for the outsourced scope and conduct regular testing. In the case of comprehensive outsourcing, the exercise cycle shall be determined based on the higher value of either the outsourced systems or data as information assets.\n5.8.2 備援需求：依據不同資訊資產價值及可用性等級，考量其備援需求，必要時，得建立異地備援機制。\nBackup requirements: According to the value and availability level of different information assets, consider their backup requirements, and establish a remote backup mechanism when necessary.\n5.9 可攜式電腦及儲存媒體管理\nPortable computer and storage media management\n5.9.1 委外廠商如需攜帶可攜式電腦或儲存媒體如磁片、光碟、隨身碟、外接式硬碟等進入專案場域使用，需經陪同之本實驗室人員同意。\nIf outsourcing vendors need to bring portable computers or storage media such as disks, CDs, flash drives, external hard drives, etc. into the project field for use, it must obtain the consent of the accompanying Lab's personnel.\n5.9.2 廠商維修人員，當進入專案場域並使用可攜式電腦或儲存媒體時，需有監控設備進行監控或本實驗室人員全程陪同。\nWhen the maintenance personnel of the vendor enter the project field and use portable computers or storage media, it must be monitored by monitoring equipment or accompanied by the Lab's personnel throughout the process.\n5.10 例外作業Exceptional work\n資訊委外服務之專案團隊應遵循本程序書之規範，提出適當安全需求項目。但若因成本、時效、委外服務之特性、委外廠商之局限性等相關因素之考量，而致本程序書所規範之安全需求無法完全適用時，專案團隊得以簽呈方式，提出其他適切之安全需求與規劃，提報計畫主持人簽核。\nThe project team of information outsourcing service shall follow the specification of this process and put forward appropriate security requirement. However, if due to the consideration of related factors such as cost, timeliness, characteristics of outsourced services, and limitations of outsourced vendors, the security requirements specified in this process cannot be fully applied, the project team can submit other appropriate security requirements and plans to the project principal for approval.\n5.11 服務變更管理Service change management\n委外廠商所提供之相關服務內容如有變更，需經由專案經理以簽呈方式通報計畫主持人，並視需求附上相關風險評鑑之佐證資料，經計畫主持人核可後，方能進行變更，其服務變更內容如下：\nAny changes to the services provided by the outsourced vendor shall be communicated to the project principal by the project manager through a signed document. The document shall include relevant risk assessment supporting materials as required. After approval by the project principal, the changes can be implemented. The service changes are as follows:\n5.11.1 系統網路架構改變。\nSystem network architecture changes.\n5.11.2 使用新的技術。\nUse of new technologies.\n5.11.3 產品轉換至新版本。\nProduct transition to a new version.\n5.11.4 新的開發工具及環境。\nNew development tools and environment.\n5.11.5 服務設備之搬遷。\nRelocation of service equipment.\n5.11.6 更換服務提供廠商或服務人員。\nChange of service provider or service personnel.\n6. 參考文件Reference\n6.1 IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.2 IMI-NCKU-D-005 委外廠商與人員保密切結書\nIMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\n6.3 IMI-NCKU-B-006 威脅與風險評鑑程序書\nIMI-NCKU-B-006 Threat and Risk Assessment Management Process\n6.4 IMI-NCKU-D-009 廠商軟體評估表\nIMI-NCKU-D-009 Vendor Software Evaluation Form\n6.5 IMI-NCKU-D-010 廠商硬體評估表\nIMI-NCKU-D-010 Vendor Hardware Evaluation Form\n6.6 IMI-NCKU-D-011 場域服務變更申請表\nIMI-NCKU-D-011 Change of Field Service Application Form\n\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n文件編號\nForm No.\nIMI-NCKU-B-004\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n文件編號\nForm No.\nIMI-NCKU-B-004\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n9\n\n",
    "C:\\Users\\user\\Desktop\\VScode\\test\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-003_變更管理程序書 Change Management Process_0704修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n變更管理程序書\nChange Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-003         Form No.: IMI-NCKU-B-003\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.09\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Content\n1.\t目的Purpose\t4\n2.\t適用範圍Scope of Application\t4\n3.\t權責Roles and Responsibilities\t4\n4.\t名詞定義Definition of Terms\t4\n5.\t作業說明Operation instruction\t5\n6.\t參考文件Reference\t8\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）資訊安全管理制度執行之範圍，達成資安管理制度之目標，並為有效管理專案場域之專案系統變更及評估影響，在該專案執行期間，提供資料變更請求獲得妥善管理、追蹤與實施之資訊環境，並符合相關法規之要求，使其免於遭受內、外部的蓄意或意外之威脅避免資訊安全問題，特制定本程序書。\nTo ensure the scope of the cyber security management system implementation at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\"), and achieve the objectives of the security management system, as well as effectively manage system changes and assess their impact within the project in the project field. During the execution of the project, to provide proper management, tracking, and implementation of data change requests in the cyber environment, in compliance with relevant regulations, to prevent cyber security issues from intentional or unintentional threats, both internal and external, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and the project field.\n3. 權責Roles and Responsibilities\n3.1 計畫主持人：外部溝通、人員指派。\nProject principal: External communication, personnel assignment.\n3.2 專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3 行政經理：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4 軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware Department: Technology development, patch the program, project schedule planning.\n3.5 測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n4.1 專案人員：本實驗室與專案場域之內部人員與委外廠商。\nProject Personnel: Internal the Lab personnel and outsourced vendors.\n4.2 委外廠商：支援本專案之委外廠商，包含委外廠商之分包商、顧問或代表等。\nOutsourced vendors: Outsourced vendors who support this project, including subcontractors, consultants, and representatives.\n4.3 變更：係指當管理本專案作業、技術、工程和原有作業規範或設計規範有所改變或偏離，且此類改變或偏離未曾執行或發生過，或雖曾發生但無紀錄或書面資料可供依循者。\nChange: Refers to changes or deviations in the operation, technology, engineering, and original operating specifications or design specifications of the management project, wherein such changes or deviations have either not been implemented or occurred, or have occurred but there is no record or written information available to follow.\n5. 作業說明Operation instruction\n5.1 啟動變更請求Initiate a change request\n當變更提出者參照識別變更來源所定義的分類去執行變更請求管理，需填寫「IMI-NCKU-D-008 專案場域變更申請表」。\nWhen the change initiator refers to the classification defined by the change source to execute change request management, the \"IMI-NCKU-D-008 Project Field Change Request Form\" shall be filled out.\n5.2 評估變更請求Assessing the request for change\n當提出變更申請後，由專案經理進行識別影響項目、進行對影響的風險評估、提出變更規劃書（含程序書、測試、人員訓練等）後，由計畫主持人做最終決斷，並提報資產擁有者。\nAfter submitting a change request, the project manager shall identify the impacted items, perform a risk assessment on the impacts, and develop a change plan (including process, testing, and personnel training). The final decision shall be made by the project principal, who shall then report to the asset owner.\n5.3 變更請求通知Change request notification\n經計畫主持人授權後，由專案經理向資產擁有者報告變更項目、變更順序以及人員訓練規劃，且應得到資產擁有者核准，若資產擁有者不核准，則需告知相關風險，資產擁有者之建議應紀錄於該「IMI-NCKU-D-008 專案場域變更申請表」。\nAfter being authorized by the project principal, the project manager contacts the asset owner to report the change items, change sequence, and personnel training plan, which must be approved by the asset owner. If the asset owner does not approve, it shall be informed of the relevant risks, and the recommendations shall be recorded in the \"IMI-NCKU-D-008 Project Field Change Request Form\".\n5.4 安全檢查Security check\n當變更完成準備運轉前，應執行測試前安全檢查，避免惡意程式影響場域運作並且有適當的修補措施，應參考「IMI-NCKU-B-013 惡意軟體防護管理程序」與「IMI-NCKU-B-014 修補管理程序書」進行，確認完成下列事項確認無誤後，始可作業：\nWhen the change is complete and prepare for operation, a pre-test security check shall be performed to prevent malicious programs from affecting field operations, and appropriate patch measures shall be taken. It shall be implemented by refer to \"IMI-NCKU-B-013 Malware Protection Management Process\" and \"IMI-NCKU-B-014 Patch Management Process\". After confirming that the following items are completed and correct, the operation can be performed:\n5.4.1 應執行之風險評估及所提之改善建議均已完成。\nThe risk assessment that shall be performed and the proposed improvement recommendations have been completed.\n5.4.2 場域施工與建置均符合設計之規格。\nField establishment and construction are in compliance with the design specifications.\n5.4.3 操作、維修、異常及緊急應變處理等程序均已完成修正更新。\nOperation, maintenance, abnormality and emergency response procedures have been corrected and updated.\n5.4.4 確認變更影響所及之人員均完成告知或訓練。\nConfirm that all personnel affected by the change have been notified or trained.\n5.4.5 相關的圖樣、作業程序、操作參數等文件資料均已修訂更新。\nRelevant documents such as drawings, operating procedures, and operating parameters have been revised and updated.\n5.4.6 上述所有項目經確認無誤後，始可作業。\nAfter all the above items are confirmed to be correct, the operation can be started.\n5.5 人員告知與教育訓練Personnel notification and training\n告知或訓練之目的在於確保相關人員能安全的操作變更後之設備、設施或程序，並能熟練的處理任何可能發生之異常或緊急狀況。因此，對於變更影響所及之人員，包含操作、維修保養、承攬等人員，應於變更正式啟用前告知修改之相關事項或施予必要之訓練，以降低因變更而引起之風險，人員訓練應依據「IMI-NCKU-B-002 場域人員管理程序書」進行。\nThe purpose of notification or training is to ensure that the relevant personnel can safely operate the changed equipment, facilities, or procedures, and proficiently handle any potential abnormalities or emergencies that may occur. Therefore, for the personnel affected by the change, including operators, maintenance, contractors, etc., they shall be notified of the relevant items of the modification or given necessary training before the change is official opening, so as to reduce the risks associated with the change. Personnel training shall be conducted according to \"IMI-NCKU-B-002 Field Personnel Management Process\".\n5.6 變更請求追蹤Change Request Tracking\n監督變更進度、監督變更狀態、追蹤變更直到關閉。若有需追蹤事項，需經由內部會議決定，並指派專人負責執行，由專案經理進行追蹤，至追蹤事項結束。變更正式使用後，如確認為永久變更，其相關作業管制標準書，應於三個月內修改完成，並實施教育訓練，並記錄存查。\nMonitor change progress, monitor change status, track changes until closure. If there is an item that needs to be tracked, it needs to be decided by an internal meeting; a dedicated person must be assigned to be responsible for the implementation and tracking by the project manager until the end of the tracking event. After the change is official implemented, if it is confirmed as a permanent change, the relevant operation control standard shall be revised and completed within 3 months, and education and training shall be implemented, and records shall be kept for inspection.\n5.7 完成變更後通知Notification after completion of changes\n以上相關作業均已完成後，應以E-mail或其他適當的方式通知予資產擁有者作為正式通知。\nAfter the aforementioned operations have been completed, the asset owner shall be formally notified via e-mail or any other appropriates means of communication.\n6. 參考文件Reference\n6.1 IMI-NCKU-D-008 專案場域變更申請表\nIMI-NCKU-D-008 Project Domain Change Application Form\n6.2 IMI-NCKU-B-013 惡意軟體防護管理程序書\nIMI-NCKU-B-013 Malware Protection Management Process\n6.3 IMI-NCKU-B-014 修補管理程序書\nIMI-NCKU-B-014 Patch Management Process\n6.4 IMI-NCKU-B-002 場域人員管理程序書\nIMI-NCKU-B-002 Field Personnel Management Process\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n8\n\n\n\n\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n\n\n1\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n",
    "C:\\Users\\user\\Desktop\\IEC 62443\\IEC 62443 2-4自動化工具\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-A-001_工業自動化與控制系統資訊安全政策 Industrial Automation and Control System Cyber Security Policy_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：一般                      Level of Confidentiality: Normal\n文件編號：IMI-NCKU-A-001          Form No.: IMI-NCKU-A-001\n版    次：1.2                       Version: 1.2\n發行日期：2023.05.20                 Issue Date: 2023.05.20\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t2\n4.\t名詞定義Definition of Terms\t2\n5.\t資訊安全目標The Targets of the Cyber Security\t2\n6.\t責任Responsibilities\t3\n7.\t審查Review\t3\n8.\t實施Implementation\t3\n9.\t參考文件Reference\t4\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）與專案場域執行之專案（以下簡稱本專案）所屬資訊資產可用性、機密性與完整性，並符合相關法規之規範要求，使其免於遭受內、外部的蓄意或意外之威脅，並衡酌本實驗室之業務需求，有效落實專案場域之資安措施，特制定本政策以玆遵循。\nTo ensure the availability, confidentiality, and integrity of information assets belonging to the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and the projects executed within the project field (hereinafter referred to as \"the Project\"), and to comply with relevant regulatory requirements, safeguarding them against intentional or unintentional internal and external threats, while considering the operational needs of the Lab, this policy is hereby established for effective implementation of cyber security measures within the project field.\n2. 適用範圍Scope of Application\n本實驗室所提供工業自動化與控制系統之專案場域相關人事物皆適用。\n工業自動化與控制系統資訊安全標準IEC 62443-2-4中12項安全計畫(Security Programs, SP)規範事項涵蓋範圍如下：\nThis policy is applicable to all personnel, events, and objects related to industrial automation and control system projects provided by the Lab.\nThe scope of the 12 Security Program (SP) requirements in the accordance with IEC 62443-2-4 is as follows:\n2.1 人員安全管理政策與執行\nPersonnel Safety Management Policy and Implementation\n2.2 場域安全服務強化與執行\nField Security Service Strengthening and Implementation\n2.3 場域安全架構設計與執行\nField Security Architecture Design and Implementation\n2.4 網路通訊安全設計與執行\nNetwork Communication Security Design and Implementation\n2.5 安全儀控系統設計與執行\nSafety Instruments Systems Design and Implementation\n2.6 組態管理與執行\nConfiguration Management and Execution\n2.7 遠端存取管理與執行\nRemote Access Management and Execution\n2.8 資訊安全事件管理與執行\nCyber Security Incident Management and Execution\n2.9 帳戶管理與執行\nAccount Management and Execution\n2.10 惡意程式防護管理與執行\nMalware Protection Management and Execution\n2.11 修補程式管理與執行\nPatch Management and Execution\n2.12 備份還原管理與執行\nBackup and Restore Management and Execution\n3. 權責Roles and Responsibilities\n本實驗室與專案場域負責執行專案之內部人員、委外服務廠商與訪客皆應遵守本政策。\nThe internal personnel, outsourced service providers, and visitors of the Lab and the project field who are responsible for implementing the project shall abide by this policy.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 資訊安全目標The Targets of the Cyber Security\n維護本實驗室所提供專案場域之資訊資產正常運作，防止資訊或資訊系統受未經授權之存取、使用、控制、洩漏、破壞、竄改、銷毀或其他侵害，並確保其資產之可用性、完整性與機密性，且所有專案團隊人員應共同努力達成下列目標：\nIn order to maintain the normal operation of information assets in the project field provided by the Lab, prevent information or information systems from unauthorized access, use, control, leakage, destruction, tampering, destruction or other infringements; and ensure the availability, integrity and confidentiality of their assets, all project team personnel shall work together to achieve the following goals:\n5.1 保護本實驗室與專案場域資訊業務活動，避免未經授權的存取。\nProtect the Lab and project field cyber operation activities to avoid unauthorized access.\n5.2 保護本實驗室與專案場域資訊業務活動，避免未經授權的修改，確保其正確且完整。\nProtect the Lab and project field cyber operation activities to avoid unauthorized modification, and ensure its correctness and completeness.\n5.3 依照客戶對於工業自動化資訊安全要求，建立工業自動化資訊安全專案場域服務，進行專案場域風險管理，並依循IEC 62443-2-4需求項目落實品質管理循環(PDCA)精神，以持續改善工業自動化資訊安全管理系統之有效性。\nAccording to the client's requirements for industrial automation cyber security, establish industrial automation cyber security services for the project field, conduct risk management for the project field, and follow the IEC 62443-2-4 requirements items to implement the spirit of the quality management cycle (Plan-Do-Check-Act cycle, PDCA) to continuously improve the effectiveness of the industrial automation cyber security management system.\n5.4 辦理本實驗室與專案場域有關資訊安全教育訓練，提供單位學員資訊安全之意識與強化其對責任之認知。\nConduct cyber security education and training in the Lab and project field, and enhance the awareness of cyber security among department members while reinforcing their understanding of responsibilities.\n5.5 本實驗室及專案場域有關工業自動化資訊安全業務活動的執行須符合法令或法規之要求。\nThe implementation of the industrial automation cyber security operation activities in the Lab and the project field must comply with the requirements of laws and regulations.\n5.6 透過利害相關人及議題等要求事項，達成與資訊安全政策一致之預期。\nAchieving alignment with cyber security policy expectations through stakeholder requirements and issues etc.\n6. 責任Responsibilities \n6.1 管理階層應積極參與及支持資訊安全管理制度，並透過適當的標準和程序以實施本政策。\nManagers shall actively participate in and support the cyber security management system and implement this policy through appropriate standards and procedures.\n6.2 專案人員、委外廠商與專案相關之外部單位及人員均需依照相關安全管理程序以維護資訊安全政策。\nProject personnel, subcontractors, and project-related external units and personnel must follow relevant security management procedures to maintain cyber security policies.\n6.3 所有人員皆有責任報告資訊安全事件和任何已鑑別出之弱點。\nAll personnel are responsible for reporting cyber security incidents and any identified vulnerabilities.\n6.4 任何危及資訊安全之行為，將視情節輕重追究其刑事、民事及行政責任，或依成功大學之相關規定進行懲處。\nAny actions that endangers cyber security shall be investigated for criminal, civil, and administrative responsibilities depending on the severity of the case, or shall be punished according to the relevant regulations of NCKU.\n7. 審查Review\n7.1 本政策應至少每年審查一次，以反映政府法令、技術及業務等最新發展現況，並確保本校永續運作及工控資訊安全實務作業之能力。\nThis policy shall be reviewed at least once a year to reflect the latest developments in government laws, technology, and business, and to ensure the sustainable operation of the school and the capability of industrial automation and control system cyber security practices.\n7.2 當專案團隊或專案發生重大改變時應主動進行審查。\nThis policy shall be actively reviewed when the project team or project undergoes significant changes.\n8. 實施Implementation\n本政策需經專案團隊進行查驗後實施，修正時亦同。\nThis policy and its revisions shall be implemented after being reviewed by the project team.\n9. 參考文件Reference\n9.1 IEC 62243-2-4:2015\n\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n文件編號\nForm No.\nIMI-NCKU-A-001\n機密等級\nLevel of Confidentiality\n一般\nNormal\n版次\nVersion\n1.2\n\n\n\n\n工業自動化與控制系統資訊安全政策\nIndustrial Automation and Control System Cyber Security Policy\n文件編號\nForm No.\nIMI-NCKU-A-001\n機密等級\nLevel of Confidentiality\n一般\nNormal\n版次\nVersion\n1.2\n\n\n1\n\n3\n\n",
    "C:\\Users\\user\\Desktop\\IEC 62443\\IEC 62443 2-4自動化工具\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-001_資訊安全組織程序書 Cyber Security Organization Process_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n資訊安全組織程序書\nCyber Security Organization Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-001         Form No.: IMI-NCKU-B-001\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t1\n4.\t名詞定義Definition of Terms\t1\n5.\t作業說明Operation Instructions\t1\n6.\t參考文件Reference\t11\n\n\n1. 目的Purpose\n為促進國立成功大學資訊與機電整合實驗室（以下稱本實驗室）資訊安全管理制度執行，以有效性之組織架構達成既定之目標，增進業務運作之安全，特制定本程序書。\nTo promote the implementation of the cyber security management system at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\"), and to achieve the established objectives of effectiveness in the organizational structure, and enhance the security of business operations, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and the project field.\n3. 權責Roles and Responsibilities \n3.1 計畫主持人：外部溝通、專案稽核與核可、人員指派。\nProject principal: External communication, project audit and approval, personnel assignment.\n3.2 專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3 行政專員：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4 軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware department: Technology development, patch the program, project schedule planning.\n3.5 測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 作業說明Operation Instructions\n5.1 資訊安全組織架構與工作執掌\nCyber security organizational structure and work management\n5.1.1 資訊安全組織架構如下圖所示，資訊安全組織成員應填寫於「IMI-NCKU-D-001 資訊安全組織成員表」，若遇人員異動應加以更新。 \nThe cyber security organization structure is shown in the figure below. Members of the cyber security organization shall be documented in the \"IMI-NCKU-D-001 Cyber Security Organization Personnel List\" and updated accordingly in the event of personnel changes.\n\n\n圖 1，組織架構圖範例。\n\nFigure 1, Example of the organization structure.\n\n5.1.2 資訊安全管理委員會：由本實驗室計畫主持人指派之國立成功大學資訊與機電整合實驗室資訊安全管理委員會，負責審查資訊安全管理制度相關事項之決議。\nCyber Security Management Committee: The Cyber Security Management Committee of the National Cheng Kung University Information and Mechatronics Integration Lab is appointed by the project principal and is responsible for reviewing resolutions on matters related to cyber security management system.\n(1) 每年定期或視需要召開會議，審查資訊安全管理相關事宜。\nHold meetings on a regular basis or as needed every year to review matters related to cyber security management.\n(2) 視需要召開跨部門之資源協調會議，以協調資訊安全管理制度執行所需之相關資源分配。\nHold cross-departmental resource coordination meetings as necessary to coordinate the allocation of relevant resources required for the implementation of the cyber security management system.\n(3) 確認政策與目標一致性。\nVerify that policies are consistent with objectives.\n(4) 滿足資訊安全相關要求的承諾。\nCommit to meet relevant cyber security requirements.\n(5) 持續改善資訊安全管理系統的承諾。\nCommit to the continuous improvement of the cyber security management system.\n5.1.3 制度管理人或召集人：由本實驗室計畫主持人或由計畫主持人指派專人擔任。\nSystem Manager or Convener Person: Shall be appointed by the project principal of the Lab or designated by the project principal.\n5.1.4 資訊安全官：由資訊安全委員會指派專人擔任。 \nCyber Security Officer: A special person appointed by the Cyber Security Committee.\n(1) 協調資訊安全小組與緊急處理組執行資訊安全相關作業。\nCoordinate the cyber security team and the emergency response team to execute cyber security related operations.\n(2) 對於資訊安全管理之改善提出建議，以及協助執行資訊安全之自我檢核。\nProvide recommendations for the improvement of cyber security management, and assist in the implementation of self-assessment of cyber security.\n(3) 負責對資訊安全狀況進行預警、監控，並對資訊安全狀況與事件進行處置。\nResponsible for early warning and monitoring of cyber security status, and handling cyber security status and events.\n(4) 對於存取控制管理定期進行事件紀錄檢核，以及管理程序檢核。\nRegularly check the event records and management procedures for access control management.\n5.1.5 資訊安全小組：由資訊安全委員會指派人員組成，負責規劃及執行各項資訊安全作業。\nCyber Security Team: Composed of personnel assigned by the Cyber Security Committee, responsible for planning and executing various cyber security operations.\n(1) 資訊安全組織人員異動時，負責更新。\nWhen the personnel of the cyber security organization changes, they are responsible for updating.\n(2) 制定資訊安全管理相關規範。\nFormulate relevant specifications for cyber security management.\n(3) 辦理資訊安全相關教育訓練及活動。\nConduct cyber security-related education, training and activities.\n(4) 建立風險管理制度，執行風險管理。\nEstablish a risk management system and implement risk management.\n(5) 建立安全事件緊急應變暨復原措施。\nEstablish emergency response and recovery measures for security incidents.\n(6) 執行稽核改善建議事項。\nImplement audit improvement recommendations.\n(7) 執行預防措施之改善。\nImplementation of preventive measures for improvement.\n(8) 研討新資訊安全產品或技術。\nDiscuss new cyber security products or technologies.\n(9) 執行資訊安全管理委員會決議事項。\nImplement the resolutions of the Cyber Security Management Committee.\n(10) 鑑別資訊安全相關之法規。\nIdentify laws and regulations related to cyber security.\nA. 資訊安全小組應每年於召開管理審查會議前，針對本實驗室提供之資訊服務來識別資訊安全的相關法令、法規與契約之要求。\nThe Cyber Security Team shall identify the requirements of relevant laws, regulations and contracts for cyber security pertaining to the cyber services provided by the Lab before holding the management review meeting every year.\n5.1.6 緊急處理組：緊急處理組為任務編組，由本實驗室計畫主持人指派人員組成，成員相關權責及作業內容分述如下：\nEmergency Response Team: The Emergency Response Team shall be formed as a task group, comprising personnel assigned by the Lab project principal. The relevant roles and responsibilities of the members and the work content are as follows:\n(1) 緊急處理組組長：\n\tEmergency Response Team Leader:\nA. 當重大資安事件發生時，負責聯絡召集緊急處理組。\nWhen a major cyber security event occurs, the Leader is responsible for contacting assembling the Emergency Response Team.\nB. 協調及督導各關鍵業務流程負責人執行緊急處理作業，並協調資源之調派使用。\nCoordinate and supervise the persons in charge of each key business process to execute emergency handling operations, and coordinate the deployment and use of resources.\nC. 依據事件評估之結果，得報告上級以決議是否宣布災變及啟動業務永續運作計畫。\nAccording to the results of the event evaluation, report to the superior to decide whether to declare a disaster and start the business continuity operation plan.\nD. 當災難發生時，配合救災單位負責搶救人員、物資與設備等及現場指揮工作。\nWhen a disaster occurs, cooperate with the disaster relief unit to be responsible for rescuing personnel, materials and equipment, etc. and on-site command work.\nE. 負責災後協調指揮清理災害現場及復原工作。\nResponsible for post-disaster coordination to clean up disaster sites and conduct restoration work.\n(2) 各關鍵業務流程負責人員：\nPersonnel responsible for each key business process:\nA. 負責對資訊安全狀況進行預警、監控，及對資訊安全事件進行處置\nResponsible for early warning and monitoring of cyber security status and handling of cyber security incidents.。\nB. 負責召集相關人員，發展、維護、更新修訂及執行各災害復原程序。\nResponsible for assembling relevant personnel and for developing, maintaining, updating, revising and implementing various disaster recovery procedures.\nC. 每年負責召集相關人員進行業務永續運作計畫之測試演練。\nResponsible for annually organize testing exercises for business continuity operations involving relevant personnel.\nD. 負責原營運場所或異地備援場所之應變、處理、復原及運轉測試工作。\nResponsible for the response, processing, restoration, and operation test of the original operating site or remote backup site.\nE. 負責災害現場證據收集，俾利未來訴訟與損害求償事宜。\nResponsible for the collection of evidence at the disaster site to facilitate future litigation and damage claims.\nF. 災害現場評估損害狀況及執行原營運場所之現場復原工作。\nAssess the damage of the disaster site and perform on-site restoration of the original operating site.\n5.1.7 資訊安全稽核小組：由本實驗室計畫主持人指派，負責評估資訊安全管理制度之執行情形。\nCyber Security Audit Team: Assigned by the Lab project principal, responsible for assessing the implementation status of the cyber security management system.\n(1) 擬定資訊安全內部稽核計畫。\nDraft the plan for an internal audit of cyber security.\n(2) 執行資訊安全內部稽核。\nExecute the internal audit of cyber security.\n(3) 撰寫資訊安全內部稽核報告。\nWrite internal audit reports on cyber security.\n(4) 追蹤不符合事項之改善執行情形。\nTrack and improve implementation of non-conformities.\n5.2 管理審查會議\nManagement Review Meeting\n5.2.1 資訊安全管理委員會每年應召開一次管理審查會議，必要時得召開臨時會議。\nThe Cyber Security Management Committee shall hold a management review meeting every year, and may hold interim meetings when necessary.\n5.2.2 管理審查會議審查內容建議包含：\nThe content recommendations of management review meeting include:\n(1) 過往管理審查之議案的處理狀態。\nprocessing status of the proposals from previous management reviews.\n(2) 與資訊安全管理制度有關之內部及外部議題的變更。\nChanges in internal and external issues related to the cyber security management system.\n(3) 資訊安全績效之回饋，包括下列之趨勢：\nFeedback on cyber security performance, including the following trends:\nA. 不符合項目及矯正措施。\nNonconforming items and corrective measures.\nB. 監督及量測結果。\nMonitoring and measurement results.\nC. 稽核結果。\nAudit results.\nD. 資訊安全目標之達成。\nAchievement of cyber security objectives.\n(4) 關注方之回饋。\nFeedback from interested parties.\n(5) 風險評鑑結果及風險處理計畫之狀態。\nThe status of risk assessment results and risk handling plans.\n(6) 持續改善之機會。\nOpportunities for continuous improvement.\n(7) 資安治理成熟度評估。\nCyber security governance maturity assessment.\n(8) 資訊安全目標執行狀況報告。\nCyber security target implementation status report.\nA. 以「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」設定之目標為資訊安全目標。\nAccording to the \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\" to set the cyber security goals.\nB. 依「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」所列之範圍及目標擬制定CSMS有效性量測表，並以該表之量測結果做為本項審查項目之主要討論內容。\nFormulate a CSMS effectiveness measurement form according to the scope and objectives listed in \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\" and use the measurement results as a basis to discuss each review item.\nC. 資訊安全執行小組擬藉由CSMS有效性量測表之量測項目與目標水準建立CSMS績效指標，蒐集各項量測項目之相關資料，據以評估本實驗室資訊安全目標之達成情形。\nThe Cyber Security Execution Team intends to establish CSMS performance indicators based on the measurement items and target levels of the CSMS effectiveness measurement form, and collect relevant data on each measurement item to evaluate the Lab's achievement of cyber security goals.\n5.2.3 管理審查會議之決議事項建議包含：\nSuggestions for resolutions at the management review meeting include:\n(1) 與持續改善機會有關之決策。\nDecisions related to continual improvement opportunities.\n(2) 任何對資訊安全管理系統變更之需要。\nAny need for changes to the cyber security management system.\n(3) 資訊安全制度執行之各項改進措施。\nVarious improvement measures for the implementation of the cyber security system.\n(4) 更新風險評鑑與風險處理計畫。\nUpdated risk assessment and risk management plans.\n(5) 針對可能影響資訊安全制度之內外部事件，修正資訊安全管理流程與控制措施。內外部事件包括：\nRevisions to the cyber security management process and control measures in response to internal and external events that may affect the cyber security system. Internal and external events include:\nA. 營運需求的變更。\nChanges in operational requirements.\nB. 安全需求的變更。\nChanges in security requirements.\nC. 影響現行營運需求的業務程序變更。\nChanges to business processes that affect current operational requirements.\nD. 管理或法規需求的變更。\nChanges in management or regulatory requirements.\nE. 契約要求的變更。\nChanges to contractual requirements.\nF. 可接受風險等級或標準的變更。\nChanges to acceptable risk levels or criteria.\n(6) 針對資訊安全制度之需要，協調所需之資源。\nCoordinate the required resources based on the needs of the cyber security system.\n(7) 控制措施及有效性評量方式的改善。\nImprovement of control measures and effectiveness evaluation methods:\nA. 評量時應決定執行事項、所需資源、負責人員、完成時間、成果評估方式等項目，以確認資訊安全目標之達成。\nDuring the evaluation, items such as implementation items, required resources, responsible personnel, completion time, and result evaluation methods shall be determined to confirm the achievement of cyber security objectives.\nB. 本實驗室應每年檢視「IMI-NCKU-D-003 資安管理指標暨有效性量測表」之量測執行狀況。\nThe Lab shall inspect the measurement execution status of \" IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form\" every year.\nC. 若「IMI-NCKU-D-003 資安管理指標暨有效性量測表」之量測項目與目標水準有進行調整之需要，可進行討論與改善決議。\nIf there is a need to adjust the measurement items and target levels of \"IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form,\" discuss and improve the resolution.\n5.3 組織間的合作及協調\nCooperation and Coordination among Organizations\n5.3.1 為確保資訊安全事件發生時，儘速執行事件處理，須與權責或外部單位隨時保持聯繫，例如：主管機關、資通安全會報、消防單位等；並建立與組織資訊安全管理制度相關之「IMI-NCKU-D-002 外部單位聯絡清單」。\nIn order to ensure that when a cyber security incident occurs, the incident is handled as soon as possible, it is necessary to remain in contact with authorities and external units at all times, including the competent authority, the cyber security report, the fire department, etc.; and establish and organize an \"IMI-NCKU-D-002 External Contact List\" related to the cyber security management system.\n5.3.2 「IMI-NCKU-D-002 外部單位聯絡清單」每年至少一次由專案經理負責維護，視組織或合約變動適時更新。\nThe \"IMI-NCKU-D-002 External Contact List\" shall be updated by the project manager at least once a year, and revised in due course depending on changes in the organization or contract.\n5.3.3 應隨時與資訊安全技術相關團體維持聯繫，獲取資訊安全技術及產品資訊與知識，以及處理資訊安全事件或執行系統修補資訊等，並將資訊建立於「IMI-NCKU-D-002 外部單位聯絡清單」，由資訊安全小組負責維護更新。\nKeep in touch with groups related to cyber security technology at all times to obtain information and knowledge on cyber security technology and products, as well as to deal with cyber security incidents and implement the information of system patch. The information shall be documented in \"IMI-NCKU-D-002 External Contact List,\" which maintained and updated by the Cyber Security Team.\n5.3.4 參考「IMI-NCKU-B-011 事件管理程序書」與相關權責單位建立通報管道並執行通報作業，聯繫方式應詳列於「IMI-NCKU-D-002 外部單位聯絡清單」。\nRefer to \"IMI-NCKU-B-011 Incident Management Process\" to establish notification channels with relevant responsible units and execute notification operations. The contact information shall be listed in the \"IMI-NCKU-D-002 External Contact List.\"\n5.4 資訊安全目標的達成計畫與量測方式\nCyber Security Target Achievement Plan and Measurement Method\n5.4.1 資訊安全目標應與資訊安全政策一致並可量測，同時應考量適用之資訊安全要求，以及風險評鑑及處理之結果。並將資訊安全目標與相關事項傳達給本實驗室人員、委外廠商與資安作業相關單位，且於定期或組之重大變更時進行更新。\nCyber security objectives shall be consistent with the cyber security policy and must be measurable. At the same time, the applicable cyber security requirements and the results of risk assessment and treatment shall be taken into consideration. Cyber security goals and related matters shall be communicated to the Lab's personnel, outsourced vendors, and cyber security operation related units, and the goals shall be updated regularly or when there are major changes in the organization.\n5.4.2 應定期規劃達成資訊安全目標作業，應包含：\nThe operation to achieve cyber security objectives shall be regularly planned and shall include:\n(1) 相關執行活動或事項。\nRelevant implementation activities or items.\n(2) 所需投入之人員、預算、設備技術與程序表單等資源。\nRequired resources such as personnel, budget, equipment technology, and procedure lists.\n(3) 活動或事項負責人員。\nPersonnel responsible for the activities or items.\n(4) 活動或事項預計完成時間。\nEstimated completion time of activities or items.\n(5) 管理目標是否達成之評估方式。\nEvaluation method of whether management objectives were achieved\n5.4.3 完成上述資訊安全目標達成作業規劃並詳列於「IMI-NCKU-D-003 資安管理指標暨有效性量測表」，由資訊安全小組負責維護更新。\nThe operation plan for achieving the aforementioned cyber security objectives shall be developed and documented in \"IMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form,\" which shall be maintained and updated by the Cyber Security Team.\n5.5 專案管理的資訊安全\nCyber Security for Project Management\n5.5.1 無論任何型態的專案，於需求說明書或契約書中，應對資訊安全加以陳述。\nIn any type of project, cyber security shall be addressed in the requirements specification or contract document.\n5.5.2 專案啟始時應執行風險評鑑，以評估專案實施階段可能發生的資訊安全風險。\nRisk assessment shall be carried out at the beginning of the project to assess the cyber security risks that may occur during the project implementation stage.\n5.5.3 資訊安全專案管理之運作應依據專案管理五階段：啟始(Initiating)、規劃(Planning)、執行(Executing)、監控(Monitoring)和結束(Closing)，將資訊安全管理制度規範納入該專案的每一個階段進行控管。\nOperation of cyber security project management shall be based on five phases of project management: Initiating, Planning, Executing, Monitoring, and Closing, and cyber security management system rules shall be included in the project controls at every stage of the Project.\n5.5.4 專案管理應對專案相關人員進行角色界定與責任配置。\nProject management shall define the roles and assign responsibilities of project-related personnel.\n5.6 行動裝置及遠距工作\nMobile Devices and Remote Working\n5.6.1 私人之行動裝置連結本實驗室無線網路，應有正常登錄程序。\nThere shall be a normal login procedure for personal mobile devices to connect to the Lab's wireless network.\n5.6.2 公務之行動裝置不得破解或越獄，程式應於合法官方管道下載。\nSchool-issued mobile devices must not be cracked or jailbroken, and programs shall be downloaded from legitimate official channels.\n5.6.3 勿於公務之行動裝置隨意點選社群網站或即時通訊軟體中之超連結。\nDo not randomly click on hyperlinks in social networking sites or instant messaging software when using official mobile devices.\n5.6.4 未經單位網路管理人員授權許可，禁止執行網路偵測、弱點掃描、封包收集分析等工具軟體。\nWithout the authorization of the department's network management personnel, it is prohibited to execute tools and software such as network detection, vulnerability scanning, and packet collection and analysis.\n5.6.5 可攜式電腦建議安裝防毒軟體，並定期檢查作業系統修正程式與更新病毒碼為最新版本。\nIt is recommended to install antivirus software on portable computers, and regularly check the operating system's repair program and update the virus definitions to the latest version.\n5.6.6 個人專屬行動裝置使用時應謹防資訊外洩或是中毒。\nBeware of information leakage and viruses when using personal mobile devices.\n5.6.7 為確保本實驗室遠距工作之安全，應訂定作業管理規範，以降低遠距工作風險，相關程序與方法請參閱「IMI-NCKU-B-010 遠端存取安全管理程序書」。\nIn order to ensure the security of remote work in the Lab, operation management regulations shall be formulated to reduce the risk of remote work. For related procedures and methods, please refer to \"IMI-NCKU-B-010 Remote Access Security Management Process.\"\n6. 參考文件Reference\n6.1 IMI-NCKU-D-001 資訊安全組織成員表\nIMI-NCKU-D-001 Cyber Security Organization Personnel List\n6.2 IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.3 IMI-NCKU-D-002 外部單位聯絡清單\nIMI-NCKU-D-002 External Contact List\n6.4 IMI-NCKU-D-003 資安管理指標暨有效性量測表\nIMI-NCKU-D-003 Cyber Security Management Indicators and Effectiveness Evaluation Form\n6.5 IMI-NCKU-B-011 事件管理程序書\nIMI-NCKU-B-011 Incident Management Process\n6.6 IMI-NCKU-B-010 遠端存取安全管理程序書。\nIMI-NCKU-B-010 Remote Access Security Management Process\n\n\n資訊安全組織程序書\nCyber Security Organization Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n資訊安全組織程序書\nCyber Security Organization Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n9\n\n",
    "C:\\Users\\user\\Desktop\\IEC 62443\\IEC 62443 2-4自動化工具\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-002_場域人員管理程序書 Field Personnel Management Process_0630修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n場域人員管理程序書\nField Personnel Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-002         Form No.: IMI-NCKU-B-002\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t4\n2.\t適用範圍Scope of Application\t4\n3.\t權責Roles and Responsibilities\t4\n4.\t名詞定義Definition of Terms\t4\n5.\t作業說明Operation Instructions\t5\n6.\t參考文件Reference\t12\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）資訊安全管理制度執行之範圍，達成資安管理制度之目標，並為有效管理本實驗室專案場域之專案中參與人員，在專案執行期間，具備能力與專業知識，遵守專案場域管理與資訊安全要求，熟悉資訊安全程序，避免資訊安全問題，維持專案場域正常運作，特制定本程序。\nTo ensure the scope of the cyber security management system at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and achieve the goals of the security management system, and to effectively manage the participants in the project field of the Lab's project, it is necessary for the participants to possess the required capabilities and professional knowledge, comply with the project field management and cyber security requirements, be familiar with cyber security procedures, avoid cyber security issues, and maintain the normal operation of the project field, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and project field.\n3. 權責Roles and Responsibilities\n3.1  計畫主持人：外部溝通、專案稽核與核可、人員指派。\nProject principal: External communication, project audit and approval, personnel assignment.\n3.2  專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3  行政專員：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4  軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware department: Technology development, patch the program, project schedule planning.\n3.5  測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n4.1  專案人員：本實驗室內部人員與委外廠商。 \nProject personnel: Internal the Lab personnel and outsourced vendors.\n4.2  委外廠商：支援本專案之委外廠商，包含委外廠商之分包商、顧問或代表等。 \nOutsourced vendors: Outsourced vendors who support this project, including subcontractors, consultants, and representatives.\n5. 作業說明Operation Instructions\n5.1  為了解專案場域之範圍與內容，可參考架構如下圖1： \nIn order to understand the scope and content of the project field, please refer to Figure 1 below for the structure:\n\n圖1、場域架構圖範例。\nFigure 1, Example of field architecture diagram.\n\n5.2  本專案之專案人員組織圖參考如下圖2： \nFor the organization chart of project personnel, please refer to Figure 2 below:\n\n圖2、本實驗室專案人員組織圖範例。\n\n\nFigure 2, Example organization chart of the Lab's project personnel.\n\n5.3  本實驗室與專案場域資訊安全政策與承諾\nCyber security policy and commitment of the Lab and project field\n任何指派到專案場域之專案人員應詳知本專案資訊安全政策與承諾與遵守資產擁有者相關要求之職責、政策和程序以及IEC 62443-2-4規範，其中人員包括本專案執行人員、委外廠商、分包商與顧問或代表人員，詳如「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」所示。\nAll personnel assigned to the project field shall be fully aware of the project's cyber security policies, commitments, and the responsibilities, policies, and procedures pertaining to the asset owner as well as the requirements specified in IEC 62443-2-4 standard. The personnel mentioned include project implementers, outsourced vendors, subcontractors, consultants, and representatives, as detailed in \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\".\n5.4  專案人員職務資格要求與職責\nQualification Requirements and Responsibilities of Project Personnel\n所有參與本專案與專案場域之相關專案執行人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，應先經過實驗室安全背景調查(如：人員資料、良民證等)，除具備賦予權責的專業技能與知識外，並需通過IEC 62443教育訓練，其職務資格與職責詳如下表：\nAll personnel involved in this project and the project field, including project executives, outsourced vendors, subcontractors, and consultants or representatives, shall undergo the Lab's security background check (e.g., personnel information, Police Criminal Record Certificate, etc.). In addition to possessing the necessary professional skills and knowledge, they shall also pass IEC 62443 education and training. Job qualifications and responsibilities are detailed in the table below:\n\n表 1、職務資格與權責。\nTable 1, Job qualifications and responsibilities.\nPosition\nQualification\nResponsibilities\n計畫主持人\nProject Principal\n理工博士、年資二十年以上。\nDoctor of science and engineering, more than 20 years of experience.\n外部溝通、挑選合格的人員擔任安全主管，確保自動化系統的安全性，並執行專案稽核與核可。\nExternal communication, selection of qualified personnel as security supervisors, ensuring the security of automated systems, and conducting project audits and approvals.\n專案經理\nProject Manager\n製造資訊背景之碩士、年資超過一年以上、熟悉軟體開發程式語言、具備專案管理能力。\nMaster's degree in Manufacturing Information, more than 1 year of experience, familiarity with software development programming languages, and project management capabilities.\n監督、內外部溝通、時程規劃、風險評估、帳號管理。\nSupervision, internal and external communication, schedule planning, risk assessment, account management.\n行政專員\nAdministrative Commissioner\n學士畢業、精通文書管理程式、具備會計相關知識、熟悉學校作業。\nBachelor's degree, proficient in document management procedures, accounting-related knowledge, familiar with university operations\n內外部溝通、執行行政事務、人事管理事務、教育訓練召集，內部稽核。\nInternal and external communication, executive administrative affairs, personnel management affairs, convening education and training, internal audit.\n軟體工程師\nSoftware Engineer\n製造資訊背景之碩士、熟悉軟體開發程式語言、了解嵌入式設備、知悉工控通訊協定。\nMaster's degree in Manufacturing Information, familiar with software development programming language, understands embedded devices, understands industrial control communication protocols\n技術開發、程式修補、專案進度規劃。\nTechnology development, program repair, project schedule planning.\n測試工程師\nTest Engineer\n製造資訊背景之碩士、熟悉軟體開發程式語言、會使用測試軟體。\nMaster's degree in Manufacturing Information, familiar with software development programming language, able to use testing software\n專案進度規劃、軟體測試、報告測試結果。\nProject schedule planning, software testing, and reporting of test results.\n\n5.5  人員指派辦法\nPersonnel assignment method\n5.5.1 本專案人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，派遣至專案場域前，需了解資產擁有者之政策、程序等要求，並使用「IMI-NCKU-D-007 專案人員評鑑表」評核後合格者，經計畫主持人同意後，由行政專員以書面形式通知資產擁有者，待資產擁有者核准後，始能進入資產擁有者專案場域執行該專案。\nThe project personnel, including project executives, outsourced vendors, subcontractors, consultants, and representatives need to understand the asset owner's policies, procedures, and other requirements before being dispatched to the project field, and use the \"IMI-NCKU-D-007 Project Personnel Evaluation Form.\" After the evaluation, if the project principal approves, the administrative commissioner shall notify the asset owner in writing. After the asset owner approves, the personnel can enter the asset owner's project field for execution the project.\n5.5.2 派遣至本專案人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，應遵守資產擁有者於場域的各項資訊安全要求的政策和程序，如：變更管理、工作許可等，並提供背景資料與犯罪紀錄調查（如，良民證），經行政專員確認符合本專案人員條件後，簽署「IMI-NCKU-D-005 委外廠商與人員保密切結書」作為依據。\nAll personnel assigned to the project, including executing personnel, outsourced vendors, subcontractors, consultants, and representatives, shall comply with the policies and procedures of the asset owner's various cyber security requirements in the field, such as management of changes (MoC), permit to work (PtW), etc., and shall provide background information and criminal record investigation (such as Police Criminal Record Certificate). After the administrative commissioner confirms that the person meets the requirements for project personnel, they must sign the \"IMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\" as the basis.\n5.6  人員教育訓練\nPersonnel education and training\n為促使本專案執行人員，包括本專案執行人員、委外廠商、分包商與顧問或代表人員，迅速了解專案場域業務狀況進而提高工作效能，由計畫主持人授權行政專員，向專案人員說明本專案之運作，並需配合資產擁有者政策、程序、作業標準以及資料保密等要求，進行相關訓練，促使人員於最短時間內能適應並勝任。\nIn order to promote the implementation of the project and help executing personnel, outsourced vendors, subcontractors, consultants, and representatives to quickly understand the business status of the project field and improve work efficiency, the project principal authorizes the administrative commissioner to explain project operations to the project personnel, and shall cooperate with the asset owner's policies, procedures, operating standards, and data confidentiality requirements, to conduct relevant training to enable personnel to swiftly adapt and gain competence.\n5.6.1 本專案人員應瞭解本專案任何變更，應依據「IMI-NCKU-B-003 變更管理程序書」進行變更申請，由資產擁有者同意後，使得進行變更。\nThe project personnel shall be aware of any changes in the project, and shall apply for changes in accordance with the \"IMI-NCKU-B-003 Change Management Process\", and make changes after the asset owner agrees.\n5.6.2 行政專員負責：每年招開工控資安教育訓練課程，可以上課、會議、實作等方式自行辦理訓練，並於「IMI-NCKU-D-004 人員資料表」中登錄。\nThe administrative commissioner is responsible for conducting industrial automation and control system cyber security education and training courses every year, in the form of classes, meetings, implementation, etc., and shall document it in the \"IMI-NCKU-D-004 Personnel Data Sheet\".\n5.6.3 視需要派人參加外部資安相關訓練，由受訓人員辦理報名手續準時出席。\nIf necessary, personnel shall be sent to participate in external cyber security related training, and the trainees shall go through the registration procedures and attend on time.\n5.6.4 專案場域自訓之訓練教材以相關品質文件、作業標準為主，講師由專案場域資深人員或曾接受過相關訓練之人員擔任。\nThe training materials for project field self-training are mainly based on relevant quality documents and operating standards, and the lecturers are senior personnel in the project field or personnel who have received relevant training.\n5.6.5 外部受訓所取得之證書，正本自存，影印本與「IMI-NCKU-D-004 人員資料表」一併存查。\nThe original of the certificates obtained from external training shall be kept on file by self, and the photocopies shall along with the \"IMI-NCKU-D-004 Personnel Data Sheet\" for reference.\n5.6.6 為管理訓練執行情形，應將上述各類訓練資料於訓練結束後於由行政專員記錄於「IMI-NCKU-D-004 人員資料表」中。\nIn order to manage the implementation of the training, the aforementioned training data shall be recorded in the \"IMI-NCKU-D-004 Personnel Data Sheet\" by the administrative commissioner after the training is over.\n5.7  人員能力資格管理考核\nPersonnel capability qualification management assessment\n5.7.1 人員派遣前應通過相關技術與工控資訊安全能力考核，使用「IMI-NCKU-D-007 專案人員評鑑表」進行考核，考核資料應與「IMI-NCKU-D-004 人員資料表」一併存查。\nPersonnel shall pass the relevant technology and industrial automation and control system cyber security capability assessment before dispatch, and use the \"IMI-NCKU-D-007 Project Personnel Evaluation Form\" for assessment. The assessment data shall be consistent with the \"IMI-NCKU-D-004 Personnel Data Sheet\" and both forms shall be kept together for inspection.\n5.7.2 每年應針對工控資訊安全至少進行一次內部或外部教育訓練，每2年應進行至少一次能力考核。\nAt least one internal or external education and training for industrial automation and control system cyber security shall be conducted every year, and at least one ability assessment shall be conducted every 2 years.\n5.8  委外廠商人員資格審查程序\nQualification review procedures for outsourced vendors\n5.8.1 專案場域因技術需求，需引用委外廠商，應經過資產擁有者同意始能派遣，詳見「IMI-NCKU-B-004 委外廠商管理程序書」。\nDue to the technical requirements of the project field, the outsourced vendors need to be cited, and the dispatch shall be approved by the asset owner. For details, see \"IMI-NCKU-B-004 Outsourced Vendors Management Process\".\n5.9  人員變更管理\nPersonnel Change Management\n5.9.1 本專案團隊因人員或技術等因素產生異動，應依據「IMI-NCKU-B-003 變更管理程序書」進行變更申請，若為人員離開本專案，需由行政專員以E-mail正式通知資產擁有者，且於該人員之「IMI-NCKU-D-004 人員資料表」中述明離開專案日期。\nWhen the project team changes due to factors such as personnel or technology, the team shall apply for changes in accordance with \"IMI-NCKU-B-003 Change Management Process\". If a person leaves the project, the administrative commissioner must formally notify the asset owner via e-mail, and state the date of leaving the project in the \"IMI-NCKU-D-004 Personnel Data Sheet\" of the personnel.\n5.9.2 本專案團隊異動經完成變更程序後，行政專員應以書面形式記錄於「IMI-NCKU-D-006 人員異動交接清單」，並重新派遣具該職位能力且獲得資格之人員，由資產擁有者同意後，始能進入專案場域執行該專案。\nAfter processing of the changes to the project team has been completed, the administrative commissioner shall record it in the \"IMI-NCKU-D-006 The Change of Personnel List\" in written form, and dispatch new qualified personnel with the ability for the position; the new personnel may access the project field to execute the project after the asset owner approves.\n5.10  溝通管理\nCommunication management\n5.10.1 本實驗室應與資產擁有者確認提供之自動化解決方案是否符合IEC 62443-2-4要求。\nThe Lab shall confirm with the asset owner whether the provided automation solution complies with the requirements of IEC 62443-2-4.\n5.10.2 本實驗室應將自動化解決方案中IACS的安全觀點傳達予資產擁有者及相關人員。\nThe Lab shall communicate the security perspective of IACS in automation solutions to asset owners and related personnel.\n5.10.3 本實驗室應確保所提供的服務符合資產擁有者的相關規定，例如：IEC 62443-2-4要求與本實驗室內部IACS的安全要求。\nThe Lab shall ensure that its services provided comply with the relevant regulations of the asset owner, such as the requirements of IEC 62443-2-4 and the Lab's internal IACS security requirements.\n5.10.4 本實驗室應與資產擁有者確認合約內的條文，避免對於合約內容產生誤解，對於委外廠商也需確認是否符合相關要求。\nThe Lab shall confirm the terms of the contract with the asset owner to avoid misunderstandings about the content of the contract. For outsourced vendors, it is also necessary to confirm whether they meet the relevant requirements.\n5.10.5 若有需追蹤事項，需經由人員管理會議或線上會議決定，指派專人建立窗口，負責執行與追蹤，並回報予專案經理直至追蹤事項結束。\nIf there is an item that needs to be tracked, it needs to be decided through a personnel management meeting or an online meeting, and a dedicated person shall be assigned to serve as the contact window, take responsibility for implementation and tracking, and report to the project manager until the end of the tracked item.\n6. 參考文件Reference\n6.1  IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.2  IMI-NCKU-D-007 專案人員評鑑表\nIMI-NCKU-D-007 Project Personnel Evaluation Form\n6.3  IMI-NCKU-D-005 委外廠商與人員保密切結書\nIMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\n6.4  IMI-NCKU-B-003 變更管理程序書\nIMI-NCKU-B-003 Change Management Process\n6.5  IMI-NCKU-D-004 人員資料表\nIMI-NCKU-D-004 Personnel Data Sheet\n6.6  IMI-NCKU-B-004 委外廠商管理程序書\nIMI-NCKU-B-004 Outsourced Vendors Management Process\n6.7  IMI-NCKU-D-006 人員異動交接清單\nIMI-NCKU-D-006 The Change of Personnel List\nField Personnel Management Procedures\nFile No.\nIMI-NCKU-B-002\nConfidentiality Level\nConfidential\nVersion\n1.2\n\n\n8\n\n\n\n\n\n場域人員管理程序書\nField Personnel Management Process\n文件編號\nForm No.\nIMI-NCKU-B-002\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n\n\n場域人員管理程序書\nField Personnel Management Process\n文件編號\nForm No.\nIMI-NCKU-B-001\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\nField Personnel Management Procedures\nFile No.\nIMI-NCKU-B-002\nConfidentiality Level\nConfidential\nVersion\n1.2\n\n\n",
    "C:\\Users\\user\\Desktop\\IEC 62443\\IEC 62443 2-4自動化工具\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-004_委外廠商管理程序書 Outsourced Vendors Management Process_0705修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-004         Form No.: IMI-NCKU-B-004\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.04\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Contents\n1.\t目的Purpose\t1\n2.\t適用範圍Scope of Application\t1\n3.\t權責Roles and Responsibilities\t1\n4.\t名詞定義Definition of Terms\t3\n5.\t作業說明Operation Instructions\t3\n6.\t參考文件Reference\t10\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）與專案場域之委外廠商，於委外執行前或委外契約履行時，其提供之交付標的與服務作業均能符合工業自動化與控制系統資訊安全管理規範，特制定本程序書。\nTo ensure that the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\") and the outsourced vendors for project fields comply with the industrial automation and control system cyber security management specifications for the verification of deliverables and service operations provided prior to or during the execution of outsourcing contracts, this process is hereby established.\n2. 適用範圍Scope of Application\n2.1 適用於本實驗室與專案場域之相關委外服務項目，包括：\nOutsourced Services of the Lab and the project field, including:\n2.1.1 工業自動化設備。\nIndustrial automation equipment.\n2.1.2 主機系統委外採購與維護。\nOutsourced procurement and maintenance of the host system.\n2.1.3 網路相關硬體設備委外採購與維護。\nOutsourced procurement and maintenance of network-related hardware equipment.\n2.1.4 應用系統套裝軟體客製化及維護\nCustomization and maintenance of application system package software.\n2.1.5 專業顧問服務委外\nOutsourced professional consulting services.\n3. 權責Roles and Responsibilities\n3.1 專案團隊︰負責依據本程序書之規定，提出適當之安全需求及擬定與廠商服務相關合約內容，並確實在合約中訂定保密條款。\nProject team: Responsible for proposing appropriate security requirements and formulating the content of contracts related to vendors services, in accordance with the provisions of this process document, and ensuring the inclusion of confidentiality clauses in the contracts.\n3.2 業務權責單位Business Authority and Responsible Unit:\n3.2.1 負責審查專案團隊所擬定之合約，確認合約內容無違反本實驗室應遵循之相關規定或傷害本實驗室之權益。\nResponsible for reviewing the contract drawn up by the project team, confirming that the content of the contract does not violate the relevant regulations of the Lab that shall be followed or damage the rights and interests of the Lab.\n3.2.2 對於提供委外服務之廠商遴選，應符合專案團隊所提出之安全需求及採購辦法之規範。\nThe selection of the vendors that provide outsourced service shall comply with the security requirements and procurement methods proposed by the project team.\n4. 名詞定義Definition of Terms\n無。\nNone.\n5. 作業說明Operation Instructions\n5.1 一般條款\nGeneral terms\n5.1.1 委外廠商及其服務人員，均應遵守專案場域之「IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策」、法規與作業程序。\nThe outsourcing vendors and their service personnel shall comply with the \"IMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy,\" regulations, and operating procedures of the project field.\n5.1.2 委外廠商應負責系統維護、聯絡窗口及電話詢答服務，並解決系統相關事宜，並配合本實驗室相關程序辦理異常排除及通報事宜，如必要時應提供駐點服務。\nThe outsourcing vendors shall be responsible for system maintenance, contact windows and telephone inquiry service, and solve system-related matters, and cooperate with the relevant procedures of the Lab to handle abnormalities and notification matters, and provide on-site services if necessary.\n5.1.3 委外廠商應遵守本實驗室之相關規定，並簽訂「IMI-NCKU-D-005 委外廠商與人員保密切結書」。\nThe outsourcing vendors shall comply with the relevant regulations of the Lab, and sign the \"IMI-NCKU-D-011 Confidentiality Agreement for External Suppliers and Personnel\".\n5.1.4 委外廠商履行合約提供使用之軟體，均需為合法軟體，並不得違反智慧財產權之規定，如有違反事情發生，委外廠商須承擔所有法律責任。\nThe software provided by the outsourcing vendors to perform the contract must be legal software and must not violate the provisions of intellectual property rights. If any violation occurs, the outsourcing vendors must assume all legal liability.\n5.1.5 委外廠商使用之工具軟體及處理作業之執行紀錄，本實驗室有權進行稽核，廠商不得異議。\nThe Lab has the right to audit the execution records of the tool software and processing operations used by outsourcing vendors, and the vendors shall not object.\n5.1.6 委外廠商應留存異常處理紀錄，本實驗室得視需要查核。\nThe outsourcing vendors shall keep abnormal handling records, which may be checked by the Lab as needed.\n5.1.7 委外廠商所交付之標的物如侵害第三人合法權益時，應由承包廠商負責處理並承擔一切法律責任。\nThe contracting party shall be responsible for handling and assuming all legal liabilities when the deliverables provided by the outsourcing vendors infringe upon the legitimate rights and interests of third parties.\n5.1.8 委外廠商如因其員工執行業務之過失，造成本實驗室損失或傷害，委外廠商需負損害賠償責任。\nIf the outsourcing vendors' employees causes loss or injury to the Lab due to the negligence in the course of business, the outsourcing vendors shall be liable for damages.\n5.1.9 委外廠商相關系統之開發或負責人員離職時，應繳回其所借用之設備、軟體及作業權限。\nThe equipment, software, and operating license loaned to the outsourcing vendors shall be returned when the developer or other responsible personnel of the relevant system of the outsourcing vendors leave the job.\n5.1.10 委外廠商人員於支援業務時所獲知敏感等級以上資訊，不得對外透露。\nPersonnel from outsourced vendors, while providing support services, shall not disclose sensitive information classified at or above the designated sensitivity level to external parties.\n5.1.11 委外廠商如知悉或觀察到本實驗室系統之任何可疑的資訊安全弱點應立即通報本實驗室，並保留相關證據。\nIf the outsourcing vendors knows or observes any suspicious cyber security weaknesses of the Lab system, they shall immediately report to the Lab and retain relevant evidence.\n5.2 委外廠商要求與評估作業\nRequirements and assessment for outsourcing vendors\n5.2.1 業務委外之需求，應參考專案場域需求規格，並請委外廠商提供適當之服務建議書。\nThe requirements for business outsourcing shall be based on the project field requirements specification, and the outsourcing vendor shall be requested to provide a suitable service proposal.\n5.2.2 軟體委外採購時，得將「IMI-NCKU-D-009 廠商軟體評估表」列為建議書徵求說明文件之附件，以評估廠商所提供軟體之安全性。\nWhen software is outsourced, the \"IMI-NCKU-D-009 Vendor Software Evaluation Form\" may be listed as an attachment to the proposal request document to evaluate the security of the software provided by the vendor.\n5.2.3 硬體委外採購時，得將「IMI-NCKU-D-010 廠商硬體評估表」列為建議書徵求說明文件之附件，以評估廠商所提供硬體之安全性。\nWhen hardware is outsourced, the \"IMI-NCKU-D-010 Vendor Hardware Evaluation Form\" may be listed as an attachment to the proposal request document to evaluate the safety of the hardware provided by the vendor.\n5.2.4 委外廠商訂定資訊安全需求：\nThe cyber security requirements of the outsourcing vendor:\n(1) 委外廠商應提供參與本案相關人員之學歷、工作資格及在職證明文件。\nThe outsourcing vendor shall provide the academic qualifications, work qualifications, and on-the-job certification documents of the relevant personnel involved the project.\n(2) 委外廠商需保證與委外作業有關的各方（包括分包商）都應遵守資訊安全法令規定。\nThe outsourcing vendors need to ensure that all parties (including subcontractors) related to outsourced operations shall comply with cyber security laws and regulations.\n(3) 委外廠商於本專案發生重大資訊安全威脅時，應配合提供維護服務。\nThe outsourcing vendor shall provide maintenance services when a major cyber security threat occurs in the project.\n(4) 對於專案中資訊安全之需求，本實驗室保有查核之權利。\nThe Lab reserves the right to review the cyber security requirements in the project.\n(5) 本實驗室為落實委外之管理監督，得定期對委外廠商進行查核作業。\nIn order to implement the management and supervision of outsourcing, the Lab may regularly review the outsourcing vendors.\n5.3 資訊系統委外服務提出\nRequest for outsourcing of information system services\n5.3.1 專案團隊因業務需求提出資訊委外服務，應適當評估資訊委外之必要性。\nThe project team shall assess the necessity of outsourcing information services based on business requirements.\n5.3.2 若為主機系統之委外採購，專案團隊應對系統需求做適當規劃，以確保足夠的電腦處理及儲存容量。\nFor the outsourced procurement of the mainframe system, the project team shall make proper planning for the system requirements to ensure sufficient computer processing and storage capacity.\n5.4 資產識別與風險評鑑作業\nAsset identification and risk assessment operations\n5.4.1 專案團隊應依據「IMI-NCKU-B-006 威脅與風險評鑑程序書」，依照委外標的之資訊資產價值、可用性、機密性、完整性等級，適當評估其可能之威脅及弱點。\nThe project team shall evaluate the potential threats and vulnerabilities based on the value, availability, confidentiality, and integrity levels of the outsourced information assets, in accordance with the \"IMI-NCKU-B-006 Threat and Risk Assessment Management Process\".\n5.5 選擇或新增安全需求Select or add security requirements\n5.5.1 專案團隊依據上述風險評鑑結果，進行風險管理作業，選擇適用之安全需求項目，明訂於合約之中。\nThe project team performs risk management operations based on the above risk assessment results, selects applicable security requirements items, and clearly records them in the contract.\n5.6 硬體採購與維護Hardware procurement and maintenance\n5.6.1 廠商應提供與設備主機之架構、操作、管理、維護等相關之操作手冊、文件與技術支援，如必要亦應提供教育訓練課程。\nThe vendor shall provide operation manuals, documents and technical support related to the structure, operation, management and maintenance of the equipment host, and shall also provide education and training courses if necessary.\n5.7 系統帳號管理System account management\n5.7.1 委外系統資料、軟體或作業系統最高權限帳號、資料庫最高權限帳號，應由本實驗室計畫主持人或專案經理保管，不得直接授與委外廠商使用。\nThe outsourced system data, software or operating system account with the highest authority, and the database account with the highest authority shall be kept by the project principal or project manager of the Lab, and shall not be directly granted to the outsourcing vendors for use.\n5.7.2 委外廠商之人員如因作業需求，需對本實驗室系統進行存取，應遵循相關安全管理規範，並由本實驗室人員填寫「IMI-NCKU-D-011 場域服務變更申請表」代為提出申請。\nIf the personnel of the outsourcing vendor need to access the Lab system due to operational requirements, they shall follow the relevant security management regulations, and submit an \"IMI-NCKU-D-011 Change of Field Service Application Form\" on behalf of the Lab personnel.\n5.7.3 「IMI-NCKU-D-011 場域服務變更申請表」中應載明作業需求內容、所需權限、帳號有效時間，經由計畫主持人核准後，由專案經理依照所需權限及帳號有效時間，建立獨立之帳號供委外廠商人員使用。\nThe \"IMI-NCKU-D-011 Change of Field Service Application Form\" shall specify the content of the operation requirements, the required authority, and the valid time of the account. After approval by the project principal, the project manager shall create a separate account for the outsourcing vendor personnel according to the required authority and account validity time.\n5.7.4 委外廠商人員對於系統帳號應善盡保管之責，系統帳號不得任意交由非作業相關人員使用。\nOutsourced personnel shall be responsible for properly safeguarding system accounts, and system accounts shall not be used by individuals unrelated to the operations.\n5.7.5 委外廠商人員對於系統之操作，本實驗室各系統管理者應盡監督之責，委外廠商人員不得從事非工作範圍內之操作。各系統管理者並應於委外廠商人員完成工作後檢視系統紀錄。\nThe system managers of the Lab shall be responsible for supervising the operation of the system by the personnel of the outsourcing vendors, and the personnel of the outsourcing vendors shall not engage in operations that are not within the scope of work. Each system manager shall also check the system records after the outsourced personnel complete the work.\n5.8 緊急應變計畫Emergency response plan\n5.8.1 資訊作業若涉及本實驗室之專案業務時，得要求委外廠商配合本實驗室定期進行業務永續運作計畫，針對委外標的建立緊急應變計畫，並定期進行測試；若該委外案件屬於整體委外者，應以委外系統及資料兩者中最高資訊資產價值衡量演練週期。\nWhen it comes to projects involving the operations of the Lab, the outsourcing vendors may be required to cooperate with the Lab in developing a business continuity plan for sustainable operations. They shall establish an emergency response plan for the outsourced scope and conduct regular testing. In the case of comprehensive outsourcing, the exercise cycle shall be determined based on the higher value of either the outsourced systems or data as information assets.\n5.8.2 備援需求：依據不同資訊資產價值及可用性等級，考量其備援需求，必要時，得建立異地備援機制。\nBackup requirements: According to the value and availability level of different information assets, consider their backup requirements, and establish a remote backup mechanism when necessary.\n5.9 可攜式電腦及儲存媒體管理\nPortable computer and storage media management\n5.9.1 委外廠商如需攜帶可攜式電腦或儲存媒體如磁片、光碟、隨身碟、外接式硬碟等進入專案場域使用，需經陪同之本實驗室人員同意。\nIf outsourcing vendors need to bring portable computers or storage media such as disks, CDs, flash drives, external hard drives, etc. into the project field for use, it must obtain the consent of the accompanying Lab's personnel.\n5.9.2 廠商維修人員，當進入專案場域並使用可攜式電腦或儲存媒體時，需有監控設備進行監控或本實驗室人員全程陪同。\nWhen the maintenance personnel of the vendor enter the project field and use portable computers or storage media, it must be monitored by monitoring equipment or accompanied by the Lab's personnel throughout the process.\n5.10 例外作業Exceptional work\n資訊委外服務之專案團隊應遵循本程序書之規範，提出適當安全需求項目。但若因成本、時效、委外服務之特性、委外廠商之局限性等相關因素之考量，而致本程序書所規範之安全需求無法完全適用時，專案團隊得以簽呈方式，提出其他適切之安全需求與規劃，提報計畫主持人簽核。\nThe project team of information outsourcing service shall follow the specification of this process and put forward appropriate security requirement. However, if due to the consideration of related factors such as cost, timeliness, characteristics of outsourced services, and limitations of outsourced vendors, the security requirements specified in this process cannot be fully applied, the project team can submit other appropriate security requirements and plans to the project principal for approval.\n5.11 服務變更管理Service change management\n委外廠商所提供之相關服務內容如有變更，需經由專案經理以簽呈方式通報計畫主持人，並視需求附上相關風險評鑑之佐證資料，經計畫主持人核可後，方能進行變更，其服務變更內容如下：\nAny changes to the services provided by the outsourced vendor shall be communicated to the project principal by the project manager through a signed document. The document shall include relevant risk assessment supporting materials as required. After approval by the project principal, the changes can be implemented. The service changes are as follows:\n5.11.1 系統網路架構改變。\nSystem network architecture changes.\n5.11.2 使用新的技術。\nUse of new technologies.\n5.11.3 產品轉換至新版本。\nProduct transition to a new version.\n5.11.4 新的開發工具及環境。\nNew development tools and environment.\n5.11.5 服務設備之搬遷。\nRelocation of service equipment.\n5.11.6 更換服務提供廠商或服務人員。\nChange of service provider or service personnel.\n6. 參考文件Reference\n6.1 IMI-NCKU-A-001 工業自動化與控制系統資訊安全政策\nIMI-NCKU-A-001 Industrial Automation and Control System Cyber Security Policy\n6.2 IMI-NCKU-D-005 委外廠商與人員保密切結書\nIMI-NCKU-D-005 Confidentiality Agreement for External Suppliers and Personnel\n6.3 IMI-NCKU-B-006 威脅與風險評鑑程序書\nIMI-NCKU-B-006 Threat and Risk Assessment Management Process\n6.4 IMI-NCKU-D-009 廠商軟體評估表\nIMI-NCKU-D-009 Vendor Software Evaluation Form\n6.5 IMI-NCKU-D-010 廠商硬體評估表\nIMI-NCKU-D-010 Vendor Hardware Evaluation Form\n6.6 IMI-NCKU-D-011 場域服務變更申請表\nIMI-NCKU-D-011 Change of Field Service Application Form\n\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n文件編號\nForm No.\nIMI-NCKU-B-004\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n委外廠商管理程序書\nOutsourced Vendors Management Process\n文件編號\nForm No.\nIMI-NCKU-B-004\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n\n\n9\n\n",
    "C:\\Users\\user\\Desktop\\IEC 62443\\IEC 62443 2-4自動化工具\\成功大學送稽核版 1\\成功大學送稽核版\\SP.01\\IMI-NCKU-B-003_變更管理程序書 Change Management Process_0704修.docx": "\n\n國立成功大學\nNational Cheng Kung University\n\n變更管理程序書\nChange Management Process\n\n製造資訊與系統研究所\n(資訊與機電整合實驗室)\nInstitute of Manufacturing Information and Systems - Information and Mechatronics Integration Lab\n\n\n\n機密等級：機密                     Level of Confidentiality: Confidential\n文件編號：IMI-NCKU-B-003         Form No.: IMI-NCKU-B-003\n版    次：1.2                      Version: 1.2\n發行日期：2023.05.31                Issue Date: 2023.05.31\n\n\n修　訂　紀　錄 Revised Records\n版次\nVersion\n修訂日期\nRevise Date\n修訂頁次\nRevise Page\n修訂者\nRevisor\n修訂內容摘要\nSummary of Revisions\n1.0\n2022.10.05\n\n江品寬\n初版\nFirst Edition\n1.1\n2022.10.19\n\n鄭庭杰\n修正部分文字\nOptimize some text\n1.2\n2023.01.09\n\n古若喬\n修正部分文字與版面\nOptimize some text and layout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n目錄\nTable of Content\n1.\t目的Purpose\t4\n2.\t適用範圍Scope of Application\t4\n3.\t權責Roles and Responsibilities\t4\n4.\t名詞定義Definition of Terms\t4\n5.\t作業說明Operation instruction\t5\n6.\t參考文件Reference\t8\n\n\n1. 目的Purpose\n為確保國立成功大學資訊與機電整合實驗室（以下簡稱本實驗室）資訊安全管理制度執行之範圍，達成資安管理制度之目標，並為有效管理專案場域之專案系統變更及評估影響，在該專案執行期間，提供資料變更請求獲得妥善管理、追蹤與實施之資訊環境，並符合相關法規之要求，使其免於遭受內、外部的蓄意或意外之威脅避免資訊安全問題，特制定本程序書。\nTo ensure the scope of the cyber security management system implementation at the National Cheng Kung University Information and Mechatronics Integration Lab (hereinafter referred to as \"the Lab\"), and achieve the objectives of the security management system, as well as effectively manage system changes and assess their impact within the project in the project field. During the execution of the project, to provide proper management, tracking, and implementation of data change requests in the cyber environment, in compliance with relevant regulations, to prevent cyber security issues from intentional or unintentional threats, both internal and external, this process is hereby established.\n2. 適用範圍Scope of Application\n本實驗室與專案場域。\nThe Lab and the project field.\n3. 權責Roles and Responsibilities\n3.1 計畫主持人：外部溝通、人員指派。\nProject principal: External communication, personnel assignment.\n3.2 專案經理：監督、內外部溝通、時程規劃、風險評估、帳號管理。\nProject manager: Supervision, internal and external communication, schedule planning, risk assessment, account management.\n3.3 行政經理：內外部溝通、執行行政事務、人事管理事務、教育訓練召集。\nAdministrative commissioner: Internal and external communication, executive administrative affairs, personnel management affairs, the convening of education and training.\n3.4 軟體單位：技術開發、程式修補、專案進度規劃。\nSoftware Department: Technology development, patch the program, project schedule planning.\n3.5 測試單位：專案進度規劃、軟體測試、報告測試結果。\nTesting department: Project schedule planning, software testing, reporting of test results.\n4. 名詞定義Definition of Terms\n4.1 專案人員：本實驗室與專案場域之內部人員與委外廠商。\nProject Personnel: Internal the Lab personnel and outsourced vendors.\n4.2 委外廠商：支援本專案之委外廠商，包含委外廠商之分包商、顧問或代表等。\nOutsourced vendors: Outsourced vendors who support this project, including subcontractors, consultants, and representatives.\n4.3 變更：係指當管理本專案作業、技術、工程和原有作業規範或設計規範有所改變或偏離，且此類改變或偏離未曾執行或發生過，或雖曾發生但無紀錄或書面資料可供依循者。\nChange: Refers to changes or deviations in the operation, technology, engineering, and original operating specifications or design specifications of the management project, wherein such changes or deviations have either not been implemented or occurred, or have occurred but there is no record or written information available to follow.\n5. 作業說明Operation instruction\n5.1 啟動變更請求Initiate a change request\n當變更提出者參照識別變更來源所定義的分類去執行變更請求管理，需填寫「IMI-NCKU-D-008 專案場域變更申請表」。\nWhen the change initiator refers to the classification defined by the change source to execute change request management, the \"IMI-NCKU-D-008 Project Field Change Request Form\" shall be filled out.\n5.2 評估變更請求Assessing the request for change\n當提出變更申請後，由專案經理進行識別影響項目、進行對影響的風險評估、提出變更規劃書（含程序書、測試、人員訓練等）後，由計畫主持人做最終決斷，並提報資產擁有者。\nAfter submitting a change request, the project manager shall identify the impacted items, perform a risk assessment on the impacts, and develop a change plan (including process, testing, and personnel training). The final decision shall be made by the project principal, who shall then report to the asset owner.\n5.3 變更請求通知Change request notification\n經計畫主持人授權後，由專案經理向資產擁有者報告變更項目、變更順序以及人員訓練規劃，且應得到資產擁有者核准，若資產擁有者不核准，則需告知相關風險，資產擁有者之建議應紀錄於該「IMI-NCKU-D-008 專案場域變更申請表」。\nAfter being authorized by the project principal, the project manager contacts the asset owner to report the change items, change sequence, and personnel training plan, which must be approved by the asset owner. If the asset owner does not approve, it shall be informed of the relevant risks, and the recommendations shall be recorded in the \"IMI-NCKU-D-008 Project Field Change Request Form\".\n5.4 安全檢查Security check\n當變更完成準備運轉前，應執行測試前安全檢查，避免惡意程式影響場域運作並且有適當的修補措施，應參考「IMI-NCKU-B-013 惡意軟體防護管理程序」與「IMI-NCKU-B-014 修補管理程序書」進行，確認完成下列事項確認無誤後，始可作業：\nWhen the change is complete and prepare for operation, a pre-test security check shall be performed to prevent malicious programs from affecting field operations, and appropriate patch measures shall be taken. It shall be implemented by refer to \"IMI-NCKU-B-013 Malware Protection Management Process\" and \"IMI-NCKU-B-014 Patch Management Process\". After confirming that the following items are completed and correct, the operation can be performed:\n5.4.1 應執行之風險評估及所提之改善建議均已完成。\nThe risk assessment that shall be performed and the proposed improvement recommendations have been completed.\n5.4.2 場域施工與建置均符合設計之規格。\nField establishment and construction are in compliance with the design specifications.\n5.4.3 操作、維修、異常及緊急應變處理等程序均已完成修正更新。\nOperation, maintenance, abnormality and emergency response procedures have been corrected and updated.\n5.4.4 確認變更影響所及之人員均完成告知或訓練。\nConfirm that all personnel affected by the change have been notified or trained.\n5.4.5 相關的圖樣、作業程序、操作參數等文件資料均已修訂更新。\nRelevant documents such as drawings, operating procedures, and operating parameters have been revised and updated.\n5.4.6 上述所有項目經確認無誤後，始可作業。\nAfter all the above items are confirmed to be correct, the operation can be started.\n5.5 人員告知與教育訓練Personnel notification and training\n告知或訓練之目的在於確保相關人員能安全的操作變更後之設備、設施或程序，並能熟練的處理任何可能發生之異常或緊急狀況。因此，對於變更影響所及之人員，包含操作、維修保養、承攬等人員，應於變更正式啟用前告知修改之相關事項或施予必要之訓練，以降低因變更而引起之風險，人員訓練應依據「IMI-NCKU-B-002 場域人員管理程序書」進行。\nThe purpose of notification or training is to ensure that the relevant personnel can safely operate the changed equipment, facilities, or procedures, and proficiently handle any potential abnormalities or emergencies that may occur. Therefore, for the personnel affected by the change, including operators, maintenance, contractors, etc., they shall be notified of the relevant items of the modification or given necessary training before the change is official opening, so as to reduce the risks associated with the change. Personnel training shall be conducted according to \"IMI-NCKU-B-002 Field Personnel Management Process\".\n5.6 變更請求追蹤Change Request Tracking\n監督變更進度、監督變更狀態、追蹤變更直到關閉。若有需追蹤事項，需經由內部會議決定，並指派專人負責執行，由專案經理進行追蹤，至追蹤事項結束。變更正式使用後，如確認為永久變更，其相關作業管制標準書，應於三個月內修改完成，並實施教育訓練，並記錄存查。\nMonitor change progress, monitor change status, track changes until closure. If there is an item that needs to be tracked, it needs to be decided by an internal meeting; a dedicated person must be assigned to be responsible for the implementation and tracking by the project manager until the end of the tracking event. After the change is official implemented, if it is confirmed as a permanent change, the relevant operation control standard shall be revised and completed within 3 months, and education and training shall be implemented, and records shall be kept for inspection.\n5.7 完成變更後通知Notification after completion of changes\n以上相關作業均已完成後，應以E-mail或其他適當的方式通知予資產擁有者作為正式通知。\nAfter the aforementioned operations have been completed, the asset owner shall be formally notified via e-mail or any other appropriates means of communication.\n6. 參考文件Reference\n6.1 IMI-NCKU-D-008 專案場域變更申請表\nIMI-NCKU-D-008 Project Domain Change Application Form\n6.2 IMI-NCKU-B-013 惡意軟體防護管理程序書\nIMI-NCKU-B-013 Malware Protection Management Process\n6.3 IMI-NCKU-B-014 修補管理程序書\nIMI-NCKU-B-014 Patch Management Process\n6.4 IMI-NCKU-B-002 場域人員管理程序書\nIMI-NCKU-B-002 Field Personnel Management Process\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n8\n\n\n\n\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n\n\n1\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n變更管理程序書\nChange Management Process\n文件編號\nForm No.\nIMI-NCKU-B-003\n機密等級\nLevel of Confidentiality\n機密\nConfidential\n版次\nVersion\n1.2\n\n\n1\n\n"
}